[{"scenario_text": "A wildlife professional writing a paper.", "question_text": "Using no more than 2 sentences, describe an example scenario for the wildlife professional for which it is unclear whether it can be described as acting for personal satisfaction", "intended_scenario_type": "Ambiguous", "avgRating": 3.0, "PhraseID": "Q72", "rule": "Be mindful of their responsibility to society, and seek to meet the needs of all people when seeking advice in wildlife-related matters. They shall studiously avoid discrimination in any form, or the abuse of professional authority for personal satisfaction.", "phrase": "acting for personal satisfaction", "profession": "wildlife professional", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Be mindful of their responsibility to society, and seek to meet the needs of all people when seeking advice in wildlife-related matters. They shall studiously avoid discrimination in any form, or the abuse of professional authority for personal satisfaction.\" \nConsider the rule provided above. In the following scenario, are the wildlife professional's actions an example of acting for personal satisfaction?\n\nScenario: A wildlife professional writing a paper.", "profession_description": "Wildlife professionals are scientists that observe and study the behaviors of animals. They frequently observe the features of certain wildlife and determine the creatures' role in specific ecosystems and/or how they interact with human beings. In addition, they will often perform various experiments to either increase our knowledge about a certain species or see how humans influence the ecosystem in question.", "games": [{"id": 0, "chat": [], "player1 argument": ["Writing a paper is within the domain of a wildlife professional. It is part of the job of helping increase knowledge and spread information. Writing a paper does not show abuse of authority or discrimination. I am assuming the paper is on a relevant subject and nothing in the scenario contradicts this."], "player2 argument": ["What is this paper on. If it not on their professional subject and they are writing it on proffesional time then they are abusing their position and basically stealing from the people they are working for."], "judge explanation": ["The first argument arguing in favor of following the rule makes a good point, in that writing a paper is well within the description of a wildlife professional."], "player1 side": "for", "winner": "player1", "winner side": "for", "winner id": "FWH0ZIZ7AI", "player_ids": {"player1": "FWH0ZIZ7AI", "player2": "WJLOVYA14A", "judge": "MZBQ4CBW5D"}}]}, {"scenario_text": "The wildlife professional holds a story time weekly for pre-schoolers that does not relate to wildlife.", "question_text": "Using no more than 2 sentences, describe an example scenario for the wildlife professional for which it is unclear whether it can be described as acting in the public interest", "intended_scenario_type": "Ambiguous", "avgRating": 3.5, "PhraseID": "Q73", "rule": "Recognize and inform clients or employers of the wildlife professional’s prime responsibility to the public interest, conservation of the wildlife resource, and the environment. They shall exercise professional judgment, and avoid actions or omissions that may compromise these broad responsibilities. They shall cooperate fully with other professionals in the best interest of the wildlife resource.", "phrase": "acting in the public interest", "profession": "wildlife professional", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Recognize and inform clients or employers of the wildlife professional's prime responsibility to the public interest, conservation of the wildlife resource, and the environment. They shall exercise professional judgment, and avoid actions or omissions that may compromise these broad responsibilities. They shall cooperate fully with other professionals in the best interest of the wildlife resource.\" \nConsider the rule provided above. In the following scenario, are the wildlife professional's actions an example of acting in the public interest?\n\nScenario: The wildlife professional holds a story time weekly for pre-schoolers that does not relate to wildlife.", "profession_description": "Wildlife professionals are scientists that observe and study the behaviors of animals. They frequently observe the features of certain wildlife and determine the creatures' role in specific ecosystems and/or how they interact with human beings. In addition, they will often perform various experiments to either increase our knowledge about a certain species or see how humans influence the ecosystem in question.", "games": [{"id": 1, "chat": [], "player1 argument": ["In order for the rule to be broken, the wildlife professional must in some way shirk their responsibility to their employer, wildlife, or the environment. A wildlife professional who has story time for kids about a subject other than wildlife is neither shirking their responsibility nor breaking any rule. A professional does not need to talk only about their chosen subject."], "player2 argument": ["The wildlife professional needs to stay true to his main mission: to serve the best interests of wildlife conservation. By choosing a different subject for the weekly story-time, this professional is wasting a huge opportunity to spread the message to the very young. What a disservice to his profession, the public and the planet! Story time would be the ideal place to spread a message to save wildlife."], "judge explanation": ["While providing story time to children is noble,  if The wildlife professional is using work time to do story time then the majority of story time should be about wild life, not other interests."], "player1 side": "for", "winner": "player2", "winner side": "against", "winner id": "FWH0ZIZ7AI", "player_ids": {"player1": "MZBQ4CBW5D", "player2": "FWH0ZIZ7AI", "judge": "WJLOVYA14A"}}]}, {"scenario_text": "An insurance professional sells an insurance policy to an individual.", "question_text": "Using no more than 2 sentences, describe an example scenario for the insurance professional for which it is unclear whether it can be described as engaging in bad faith misconduct", "intended_scenario_type": "Ambiguous", "avgRating": 2.3333333333333335, "PhraseID": "Q47", "rule": "The Insurance Professional shall not have engaged in intentional, bad faith misconduct which is detrimental to IAIP at IAIP's sole determination", "phrase": "engaging in bad faith misconduct", "profession": "insurance professional ", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"The Insurance Professional shall not have engaged in intentional, bad faith misconduct which is detrimental to IAIP at IAIP's sole determination\" \nConsider the rule provided above. In the following scenario, are the insurance professional 's actions an example of engaging in bad faith misconduct?\n\nScenario: An insurance professional sells an insurance policy to an individual.", "profession_description": "An insurance professional is trained in risk analysis, which involves evaluating risk exposure to measure the potential losses to individuals and businesses. They can recommend appropriate insurance coverage and perhaps reveal risk exposures. Insurance professionals are knowledgeable about the insurance options available to their clients, and can advise on insurance related purchases.", "games": [{"id": 2, "chat": [], "player1 argument": ["Selling a policy comes under the description of providing insurance options to clients and advising on insurance related purchases. No rule is broken by performing the very job you're hired to do! Nothing in the scenario indicates any involvement in misconduct. Without further context, it is not possible to rule this as an act of misconduct or bad faith."], "player2 argument": ["There are so many variables when wrting an policy.  Not known these  or intentially ignoring them could be a matter of bad faith."], "judge explanation": ["It would be in bad faith to assume that the insurance professional sold the individual a bad policy, therefore it must be assumed that the professional sold them an adequate policy, as the first argument pointed out. Therefore, the first argument wins."], "player1 side": "for", "winner": "player1", "winner side": "for", "winner id": "FWH0ZIZ7AI", "player_ids": {"player1": "FWH0ZIZ7AI", "player2": "WJLOVYA14A", "judge": "MZBQ4CBW5D"}}]}, {"scenario_text": "The health physicist shares all possible consequences of the tests the patient will undergo, even those that are extremely rare and unlikely.", "question_text": "Using no more than 2 sentences, describe an example scenario for the health physicist for which it is unclear whether it can be described as making unwarranted statements", "intended_scenario_type": "Ambiguous", "avgRating": 3.6666666666666665, "PhraseID": "Q43", "rule": "Sensational and unwarranted statements of others concerning radiation and radiation protection shall be corrected by Health Physicists, when practical.", "phrase": "making unwarranted statements", "profession": "health physicist ", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Sensational and unwarranted statements of others concerning radiation and radiation protection shall be corrected by Health Physicists, when practical.\" \nConsider the rule provided above. In the following scenario, are the health physicist 's actions an example of making unwarranted statements?\n\nScenario: The health physicist shares all possible consequences of the tests the patient will undergo, even those that are extremely rare and unlikely.", "profession_description": "A health physicist specializes in protecting people and their environment from potential radiation hazards, while making it possible to enjoy the beneficial uses of radiation.", "games": [{"id": 3, "chat": [], "player1 argument": ["It is the job of the health physicist to correct sensational, unwarranted claims of others regarding radiation. But this is not what the scenario describes. The professional is rightly describing the consequences of a patient's tests and rightly includes results that are uncommon. If I was a patient, I would want to know about all of these risks or results. It is not a violation."], "player2 argument": ["When the health physicist shares all the possible consequences that a patient could face, even ones that are extremely rare and unlikely, they are making sensational statements, which are unnecessary and could cause the patient undue distress. Every tiny risk of a procedure does not need to be detailed to the patient. The health physicist themselves is making sensational and unwarranted statements, thus breaking the rule."], "judge explanation": ["The health physicist preformed their duty by providing the patient with the correct information."], "player1 side": "for", "winner": "player1", "winner side": "for", "winner id": "FWH0ZIZ7AI", "player_ids": {"player1": "FWH0ZIZ7AI", "player2": "MZBQ4CBW5D", "judge": "WJLOVYA14A"}}]}, {"scenario_text": "The architect makes safety videos available for his employees to watch but does not enforce that they actually adhere to them.", "question_text": "Using no more than 2 sentences, describe an example scenario for the architect for which it is unclear whether it can be described as making reasonable efforts", "intended_scenario_type": "Ambiguous", "avgRating": 2.6666666666666665, "PhraseID": "Q8", "rule": "Members shall make reasonable efforts to ensure that those over whom they have supervisory authority conform their conduct to this Code.", "phrase": "making reasonable efforts", "profession": "architect", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Members shall make reasonable efforts to ensure that those over whom they have supervisory authority conform their conduct to this Code.\" \nConsider the rule provided above. In the following scenario, are the architect's actions an example of making reasonable efforts?\n\nScenario: The architect makes safety videos available for his employees to watch but does not enforce that they actually adhere to them.", "profession_description": "An archtect designs buildings and in many cases also supervises their construction.", "games": [{"id": 4, "chat": [], "player1 argument": ["To make video as only a prop for compliance measures is fraud."], "player2 argument": ["You cannot expect an architect to supervise whole construction teams. They can set up a video system and trust that the people they are working with are professional enough to watch it and follow the rules."], "judge explanation": ["I feel that Player 1 is the winner because he is right - making a video as a prop does seem fraudulent if they're not going to enforce the rules given in that video."], "player1 side": "against", "winner": "player1", "winner side": "against", "winner id": "HT91WC6TFO", "player_ids": {"player1": "HT91WC6TFO", "player2": "AEWWMGXZ7V", "judge": "2V704WG0KC"}}]}, {"scenario_text": "The teacher talked about various students with other teachers in the teacher lounge.", "question_text": "Using no more than 2 sentences, describe an example scenario for the teacher for which it is unclear whether it can be described as having a negative impact", "intended_scenario_type": "Ambiguous", "avgRating": 3.25, "PhraseID": "Q67", "rule": "Teachers should avoid conflict between their professional work and private interests which could reasonably be deemed to impact negatively on pupils/students.", "phrase": "having a negative impact", "profession": "teacher", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Teachers should avoid conflict between their professional work and private interests which could reasonably be deemed to impact negatively on pupils/students.\" \nConsider the rule provided above. In the following scenario, are the teacher's actions an example of having a negative impact?\n\nScenario: The teacher talked about various students with other teachers in the teacher lounge.", "profession_description": "A teacher is a person who teaches, especially in a school.", "games": [{"id": 5, "chat": [], "player1 argument": ["I don't feel that there is any conflict here because the teacher is discussing students with other teachers which would seem to fall in line with professional work as opposed to private interests. They are all coworkers, within their work space, discussing their professional work."], "player2 argument": ["There is no need for teacher conflict between professional work and private interests. Because they have ability to differentiate their private and personal life."], "judge explanation": ["I am judging in favor of the argument for, it is expected for a teacher in his/her professional capacity to have conversations about work with their colleagues."], "player1 side": "for", "winner": "player1", "winner side": "for", "winner id": "2V704WG0KC", "player_ids": {"player1": "2V704WG0KC", "player2": "RXEY0OKBX8", "judge": "YXEMXHD9TA"}}]}, {"scenario_text": "The visual journalist records video of a town council meeting where name cards appear in front of council members, but the angle makes it unclear which names go with which people.", "question_text": "Using no more than 2 sentences, describe an example scenario for the visual journalist for which it is unclear whether it can be described as providing context", "intended_scenario_type": "Ambiguous", "avgRating": 2.6666666666666665, "PhraseID": "Q54", "rule": "Be complete and provide context when photographing or recording subjects. Avoid stereotyping individuals and groups. Recognize and work to avoid presenting one's own biases in the work.", "phrase": "providing context", "profession": "visual journalist", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Be complete and provide context when photographing or recording subjects. Avoid stereotyping individuals and groups. Recognize and work to avoid presenting one's own biases in the work.\" \nConsider the rule provided above. In the following scenario, are the visual journalist's actions an example of providing context?\n\nScenario: The visual journalist records video of a town council meeting where name cards appear in front of council members, but the angle makes it unclear which names go with which people.", "profession_description": "A visual journalist employs the practice of strategically combining words and images to convey information.", "games": [{"id": 6, "chat": [], "player1 argument": ["This scenario is fine in a professional manner. The visual journalist is not trying to set an agenda is only presented the visual data that is presented. No one is actually identified as the name cards placement makes it unclear who they belong to. No person is stereotyped in the image and there is little evidence that anyone is placed out of context."], "player2 argument": ["The visual journalist record have experience in their fields. And it was reach to world they 100 percentage put their effort to make an real video. And in work there is no need for their own bias."], "judge explanation": ["I am agreeing with Player 1 because there is nothing unprofessional about what the visual journalist did. You cannot tell who is identified by the names so there is no harm."], "player1 side": "for", "winner": "player1", "winner side": "for", "winner id": "YXEMXHD9TA", "player_ids": {"player1": "YXEMXHD9TA", "player2": "RXEY0OKBX8", "judge": "AEWWMGXZ7V"}}]}, {"scenario_text": "The physicist in medicine tested many types of software and came up with no particular best choice, and then chooses the one that was offered for a discounted price.", "question_text": "Using no more than 2 sentences, describe an example scenario for the physicist in medicine for which it is unclear whether it can be described as the best interests", "intended_scenario_type": "Ambiguous", "avgRating": 3.6666666666666665, "PhraseID": "Q25", "rule": "Members are frequently asked to participate in the selection of equipment and software for their institution or client. When members are engaged in this activity, the best interests of patients must come first.", "phrase": "prioritizing the best interests", "profession": "physicist in medicine", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Members are frequently asked to participate in the selection of equipment and software for their institution or client. When members are engaged in this activity, the best interests of patients must come first.\" \nConsider the rule provided above. In the following scenario, are the physicist in medicine's actions an example of the best interests?\n\nScenario: The physicist in medicine tested many types of software and came up with no particular best choice, and then chooses the one that was offered for a discounted price.", "profession_description": "A physicist in medicine is a professional who applies the principles and methods of both physics and medicine. They focus on the areas of prevention, diagnosis, and treatment, as well as ensuring quality services and prevention of risks to the patients, and members of the public in general.", "games": [{"id": 7, "chat": [], "player1 argument": ["Since the physicist tested all the different software and found them to be comparable, it makes sense that they selected the one that was the least expensive. It doesn't harm the patients and it saves the hospital money, which can be used to help even more patients in the future."], "player2 argument": ["The physicist did not seek a second opinion and simply took the easy way out by going with the least expense item to cover his ineptness."], "judge explanation": ["Without choice, they going for a discounted prices. Concern about patients I choose Player 2"], "player1 side": "for", "winner": "player2", "winner side": "against", "winner id": "HT91WC6TFO", "player_ids": {"player1": "AEWWMGXZ7V", "player2": "HT91WC6TFO", "judge": "RXEY0OKBX8"}}]}, {"scenario_text": "The biologist joins an organization that seeks to clone human organs for transplant purposes.", "question_text": "Using no more than 2 sentences, describe an example scenario for the biologist for which it is unclear whether it can be described as Behaving with questionable character", "intended_scenario_type": "Ambiguous", "avgRating": 3.0, "PhraseID": "Q63", "rule": "They will not associate or allow the use of their name on any enterprise known to be illegal, fraudulent or of questionable character.", "phrase": "Behaving with questionable character", "profession": "biologist", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"They will not associate or allow the use of their name on any enterprise known to be illegal, fraudulent or of questionable character.\" \nConsider the rule provided above. In the following scenario, are the biologist's actions an example of Behaving with questionable character?\n\nScenario: The biologist joins an organization that seeks to clone human organs for transplant purposes.", "profession_description": "A biologist is a scientist who conducts research in biology. Biologists are interested in studying life on Earth, whether it is an individual cell, a multicellular organism, or a community of interacting populations.", "games": [{"id": 8, "chat": [], "player1 argument": ["Without using their identity the clone human organs used for transplant is very helpful to people and biologist makes healthy world."], "player2 argument": ["Identity can be connected to intent in such scenarios. Whos to say what their drive is and how much influance the organization has over their iden"], "judge explanation": ["I give the win to Player 1, as I agree that cloned human organs for transplant would indeed lead to a healthy world for all."], "player1 side": "for", "winner": "player1", "winner side": "for", "winner id": "RXEY0OKBX8", "player_ids": {"player1": "RXEY0OKBX8", "player2": "HT91WC6TFO", "judge": "2V704WG0KC"}}]}, {"scenario_text": "The biologist explains to a neighbor why they were not able to catch any fish in the nearby lake.", "question_text": "Using no more than 2 sentences, describe an example scenario for the biologist for which it is unclear whether it can be described as offering professional advice", "intended_scenario_type": "Ambiguous", "avgRating": 3.3333333333333335, "PhraseID": "Q65", "rule": "They will offer professional advice only on those subjects in which they are informed and qualified through professional training and experience.", "phrase": "offering professional advice", "profession": "biologist", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"They will offer professional advice only on those subjects in which they are informed and qualified through professional training and experience.\" \nConsider the rule provided above. In the following scenario, are the biologist's actions an example of offering professional advice?\n\nScenario: The biologist explains to a neighbor why they were not able to catch any fish in the nearby lake.", "profession_description": "A biologist is a scientist who conducts research in biology. Biologists are interested in studying life on Earth, whether it is an individual cell, a multicellular organism, or a community of interacting populations.", "games": [{"id": 9, "chat": [], "player1 argument": ["Even though the biologist was speaking to their neighbor, it is unprofessional to give an opinion about why they were unable to catch fish if it were related to the fish population. It is difficult to know why someone doesn't catch fish. When people talk to experts, they believe them no matter what they say. If a doctor friend tells you your mole is cancer, you believe it is true. He should keep his profession separate from his neighborhood."], "player2 argument": ["The scenario is just a couple of neighbors having a chat. Nothing indicates that this is a professional consultation.  The biologist is just being friendly with their neighbor in a non pr"], "judge explanation": ["The rule states the biologist will only offer professional advice only on those subjects in which they are informed and qualified through professional training and experience. Providing an explanation to your neighbor is not professional advice. Also, a biologist can be expected to have general information about why an individual may encounter difficulty fishing in a nearby lake. I rule for Player 2."], "player1 side": "against", "winner": "player2", "winner side": "for", "winner id": "WJLOVYA14A", "player_ids": {"player1": "AEWWMGXZ7V", "player2": "WJLOVYA14A", "judge": "YXEMXHD9TA"}}]}, {"scenario_text": "The architect's firm tell their firm colleagues to recycle, but fail to provide recycling bins in all of their offices.", "question_text": "Using no more than 2 sentences, describe an example scenario for the architect for which it is unclear whether it can be described as using sustainable practices", "intended_scenario_type": "Ambiguous", "avgRating": 2.6666666666666665, "PhraseID": "Q10", "rule": "Members should use sustainable practices within their firms and professional organizations, and they should encourage their clients to do the same.", "phrase": "using sustainable practices", "profession": "architect", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Members should use sustainable practices within their firms and professional organizations, and they should encourage their clients to do the same.\" \nConsider the rule provided above. In the following scenario, are the architect's actions an example of using sustainable practices?\n\nScenario: The architect's firm tell their firm colleagues to recycle, but fail to provide recycling bins in all of their offices.", "profession_description": "An archtect designs buildings and in many cases also supervises their construction.", "games": [{"id": 10, "chat": [], "player1 argument": ["It doesn't do any good to say that they should recycle if they do not provide them with a way to do it. If they don't provide the bins, it makes it extremely difficult for the colleagues to recycle. They don't want to haul their recyclables home to recycle them. The firm needs to provide bins."], "player2 argument": ["The architect firm is only required to encourage their client to use sustainable practices. Which is what the firm did in this scenario when it told their colleagues to recycle. The rule does not explicitly state which sustainable practices need to be carried out and the firm could be contributing in another way."], "judge explanation": ["Though the firm encourages the practce it is not required.  They should practice what they preach. However it is not a shall only a should."], "player1 side": "against", "winner": "player2", "winner side": "for", "winner id": "YXEMXHD9TA", "player_ids": {"player1": "AEWWMGXZ7V", "player2": "YXEMXHD9TA", "judge": "WJLOVYA14A"}}]}, {"scenario_text": "The wildlife professional holds a story time weekly for pre-schoolers that does not relate to wildlife.", "question_text": "Using no more than 2 sentences, describe an example scenario for the wildlife professional for which it is unclear whether it can be described as acting in the public interest", "intended_scenario_type": "Ambiguous", "avgRating": 3.5, "PhraseID": "Q73", "rule": "Recognize and inform clients or employers of the wildlife professional’s prime responsibility to the public interest, conservation of the wildlife resource, and the environment. They shall exercise professional judgment, and avoid actions or omissions that may compromise these broad responsibilities. They shall cooperate fully with other professionals in the best interest of the wildlife resource.", "phrase": "acting in the public interest", "profession": "wildlife professional", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Recognize and inform clients or employers of the wildlife professional's prime responsibility to the public interest, conservation of the wildlife resource, and the environment. They shall exercise professional judgment, and avoid actions or omissions that may compromise these broad responsibilities. They shall cooperate fully with other professionals in the best interest of the wildlife resource.\" \nConsider the rule provided above. In the following scenario, are the wildlife professional's actions an example of acting in the public interest?\n\nScenario: The wildlife professional holds a story time weekly for pre-schoolers that does not relate to wildlife.", "profession_description": "Wildlife professionals are scientists that observe and study the behaviors of animals. They frequently observe the features of certain wildlife and determine the creatures' role in specific ecosystems and/or how they interact with human beings. In addition, they will often perform various experiments to either increase our knowledge about a certain species or see how humans influence the ecosystem in question.", "games": [{"id": 11, "chat": [], "player1 argument": ["The scenario has nothing to do with their actual work except as perhaps as an hobby or as charity work. It is only a transference of information and not a study."], "player2 argument": ["Educating children, even if it's not about wildlife, is beneficial to their development and the community. Engaging these children with story telling, while not directly related to wildlife or the environment could stimulate their interest in science and related topics. This could be beneficial later in life when they choose a career path. They could be future wildlife biologists."], "judge explanation": ["I don't see there being anything unprofessional about holding a story time weekly. It is unrelated to their profession and completely acceptable. I agree with Player 2 that it could engage the children later in life."], "player1 side": "against", "winner": "player2", "winner side": "for", "winner id": "3GBB841O6A", "player_ids": {"player1": "HT91WC6TFO", "player2": "3GBB841O6A", "judge": "AEWWMGXZ7V"}}, {"id": 27, "chat": [], "player1 argument": ["The wildlife professional has broken the rule by an act of omission -- he has failed to use the opportunity to convey information on conserving wildlife, which is his prime mission. Storytime would be a great time to get kids interested in this important cause while they're young, and he is squandering the chance."], "player2 argument": ["in effect, the professional has taken on a \"second job.\"  i don", "in effect, the professional has taken on a second job. i don't see anything wrong with that.  it's not like he has taken on a controvesial or illegal job. he's taking time by reading with some kids.the fact that it has nothing to do with wildlife may be a GOOD thing...it gives the professional time to think about more relaxing things than his job must require.  i don't see a problem."], "judge explanation": ["Player 1 is correct. The wildlife professional has neglected an aspect of his responsibilities by not using that opportunity to promote wildlife. It was poor professional judgment."], "player1 side": "against", "winner": "player1", "winner side": "against", "winner id": "FWH0ZIZ7AI", "player_ids": {"player1": "FWH0ZIZ7AI", "player2": "11W7QK9ESI", "judge": "2K2XIPE56W"}}]}, {"scenario_text": "The economic developer asks the client how their day at work has been.", "question_text": "Using no more than 2 sentences, describe an example scenario for the professional economic developer for which it is unclear whether it can be described as maintaining confidence in client affairs", "intended_scenario_type": "Ambiguous", "avgRating": 2.6666666666666665, "PhraseID": "Q76", "rule": "Professional economic developers shall maintain in confidence the affairs of any client, colleague or organization and shall not disclose confidential information obtained in the course of professional activities.", "phrase": "maintaining confidence in client affairs", "profession": "professional economic developer", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Professional economic developers shall maintain in confidence the affairs of any client, colleague or organization and shall not disclose confidential information obtained in the course of professional activities.\" \nConsider the rule provided above. In the following scenario, are the professional economic developer's actions an example of maintaining confidence in client affairs?\n\nScenario: The economic developer asks the client how their day at work has been.", "profession_description": "A professional economic developer is responsible for planning, designing, and implementing economic development strategies, as well as acting as a key liaison between public and private sectors and the community.", "games": [{"id": 12, "chat": [], "player1 argument": ["Greeting a client and asking how their day has been is a good way to build a relationship. There is very likely no exchange of confidential information by asking how the client's day has been."], "player2 argument": ["There should be a certain level of professionalism from the economic developer.  This type of interaction could be crossing the line into priveledged information.  The economic developer should be careful when doing this as to not create some type of impropriety"], "judge explanation": ["It could be a leading question therefore un ethical. I go with Player 2."], "player1 side": "for", "winner": "player2", "winner side": "against", "winner id": "WJLOVYA14A", "player_ids": {"player1": "3GBB841O6A", "player2": "WJLOVYA14A", "judge": "HT91WC6TFO"}}]}, {"scenario_text": "The professional economic developer agreed to meet publicly with their client at a restaurant in the downtown business district.", "question_text": "Using no more than 2 sentences, describe an example scenario for the professional economic developer for which it is unclear whether it can be described as maintaining confidence in client affairs", "intended_scenario_type": "Ambiguous", "avgRating": 3.3333333333333335, "PhraseID": "Q76", "rule": "Professional economic developers shall maintain in confidence the affairs of any client, colleague or organization and shall not disclose confidential information obtained in the course of professional activities.", "phrase": "maintaining confidence in client affairs", "profession": "professional economic developer", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Professional economic developers shall maintain in confidence the affairs of any client, colleague or organization and shall not disclose confidential information obtained in the course of professional activities.\" \nConsider the rule provided above. In the following scenario, are the professional economic developer's actions an example of maintaining confidence in client affairs?\n\nScenario: The professional economic developer agreed to meet publicly with their client at a restaurant in the downtown business district.", "profession_description": "A professional economic developer is responsible for planning, designing, and implementing economic development strategies, as well as acting as a key liaison between public and private sectors and the community.", "games": [{"id": 13, "chat": [], "player1 argument": ["As a economic developer it is important to meet with your clients.  Meeting at a public setting is not against the rules.  Business dinner meeting are a common thing in the business world.  It provides a setting for the business relationship to work in a relaxed setting."], "player2 argument": ["While meeting over lunch isn't against the rules, it does bring into question the professionalism of the economic developer. The lunch takes place in the business district so it is possible that potential competitors could eavesdrop on their conversation over lunch. I feel these encounters with a client are best handled within an office setting as the economic developer would have more control over the information being decimated."], "judge explanation": ["I give the win to Player 2 as they are correct in pointing out the privacy and confidentiality issues of taking the meeting in a public setting."], "player1 side": "for", "winner": "player2", "winner side": "against", "winner id": "YXEMXHD9TA", "player_ids": {"player1": "WJLOVYA14A", "player2": "YXEMXHD9TA", "judge": "2V704WG0KC"}}]}, {"scenario_text": "A state officer shares unconventional ideas in a public forum.", "question_text": "Using no more than 2 sentences, describe an example scenario for the state officer for which it is unclear whether it can be described as being consistent with the public interest", "intended_scenario_type": "Ambiguous", "avgRating": 3.5, "PhraseID": "Q18", "rule": "A State Officer should not make personal investments that could reasonably be expected to create a substantial conflict between the officer’s or employee’s private interest and the public interest", "phrase": "being consistent with the public interest", "profession": "state officer", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"A State Officer should not make personal investments that could reasonably be expected to create a substantial conflict between the officer's or employee's private interest and the public interest\" \nConsider the rule provided above. In the following scenario, are the state officer's actions an example of being consistent with the public interest?\n\nScenario: A state officer shares unconventional ideas in a public forum.", "profession_description": "State officer means a person who is duly elected, appointed or retained through election to any state office, or a member of any state board, commission or council, and includes a member of the legislature.", "games": [{"id": 14, "chat": [], "player1 argument": ["While it is certainly fine for public servants to have their own ideas and opinions, not all of those ideas and opinions - especially controversial ones - need to be shared in a public forum and in an official capacity as a state officer as this could reasonably be seen as a conflict of interests and perhaps inciting unrest within the public the officer serves."], "player2 argument": ["Unconventional does not mean controversial.  Sometimes going outside the norm is needed in order to accomplish needed goals.  These unconventional ideas may be what is needed to move forward on this instead of the same old same old."], "judge explanation": ["As a state officer, you have to present yourself in a professional way that best represents your citizens. Expressing unconventional ideas could be upsetting and cause unrest. I agree with Player 1, she is the winner."], "player1 side": "against", "winner": "player1", "winner side": "against", "winner id": "2V704WG0KC", "player_ids": {"player1": "2V704WG0KC", "player2": "WJLOVYA14A", "judge": "3GBB841O6A"}}]}, {"scenario_text": "The biologist takes samples and runs a series of tests that are directly related to her employer's project.", "question_text": "Using no more than 2 sentences, describe an example scenario for the biologist for which it is unclear whether it can be described as displaying professional misconduct", "intended_scenario_type": "Ambiguous", "avgRating": 2.4, "PhraseID": "Q57", "rule": "Members should take steps to prevent corrupt practices and professional misconduct.", "phrase": "displaying professional misconduct", "profession": "biologist", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Members should take steps to prevent corrupt practices and professional misconduct.\" \nConsider the rule provided above. In the following scenario, are the biologist's actions an example of displaying professional misconduct?\n\nScenario: The biologist takes samples and runs a series of tests that are directly related to her employer's project.", "profession_description": "A biologist is a scientist who conducts research in biology. Biologists are interested in studying life on Earth, whether it is an individual cell, a multicellular organism, or a community of interacting populations.", "games": [{"id": 15, "chat": [], "player1 argument": ["The biologist job is to conduct ethical and thorough research according to strict standards.  The biologist conducted tests are related to her employer's project.  She acted within her authority to conduct such r"], "player2 argument": ["The scenario is insufficient to rule this as compliance. How do we know if the project or the employer or even the testing are ethical? The rule says the professional must 'take steps to prevent' corruption and misconduct, but the scenario doesn't describe any of these steps."], "judge explanation": ["As this person's profession is that of a biologist their employer's project was likely related to biology. Also there is no direct indication that the biologist running a series of test would violate any profession conduct. So I rule for Player 1."], "player1 side": "for", "winner": "player1", "winner side": "for", "winner id": "D7DFHXQ55M", "player_ids": {"player1": "D7DFHXQ55M", "player2": "FWH0ZIZ7AI", "judge": "YXEMXHD9TA"}}]}, {"scenario_text": "The professional economic developer agreed to meet publicly with their client at a restaurant in the downtown business district.", "question_text": "Using no more than 2 sentences, describe an example scenario for the professional economic developer for which it is unclear whether it can be described as maintaining confidence in client affairs", "intended_scenario_type": "Ambiguous", "avgRating": 3.3333333333333335, "PhraseID": "Q76", "rule": "Professional economic developers shall maintain in confidence the affairs of any client, colleague or organization and shall not disclose confidential information obtained in the course of professional activities.", "phrase": "maintaining confidence in client affairs", "profession": "professional economic developer", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Professional economic developers shall maintain in confidence the affairs of any client, colleague or organization and shall not disclose confidential information obtained in the course of professional activities.\" \nConsider the rule provided above. In the following scenario, are the professional economic developer's actions an example of maintaining confidence in client affairs?\n\nScenario: The professional economic developer agreed to meet publicly with their client at a restaurant in the downtown business district.", "profession_description": "A professional economic developer is responsible for planning, designing, and implementing economic development strategies, as well as acting as a key liaison between public and private sectors and the community.", "games": [{"id": 16, "chat": [], "player1 argument": ["Meeting in a public place to discuss confidential matters seems like a very bad error in judgement. Anyone within earshot can hear them discussion details of plans that are supposed to be confidential.", "*them discuss"], "player2 argument": ["While I would normally agree that, yes, meeting in a public space does seem to be an error in judgement, the scenario does seem to imply that it is the client that wished to meet in public. It could be that the client themselves is more comfortable meeting with the economic developer in a public space and that is what the developer needs to do to assure the clients comfort. So long as both are in agreement, and nothing confidential is necessarily discussed, I see no issue with maintaining the clients comfort level in"], "judge explanation": ["I think Player 2's counter argument is convincing. The subject of the meeting may not be confidential and the client asked for the setting."], "player1 side": "against", "winner": "player2", "winner side": "for", "winner id": "2V704WG0KC", "player_ids": {"player1": "AQ7YGXFYDL", "player2": "2V704WG0KC", "judge": "FWH0ZIZ7AI"}}, {"id": 36, "chat": [], "player1 argument": ["The developer \"agreed\" to meet the client, strongly suggesting the client made the offer to meet in public. I didn't think this is a violation in any case, but the fact that the client themselves are comfortable in a public setting makes me more comfortable judging the developer to be innocent of any impropriety."], "player2 argument": ["The economic developer should know that conversations in a downtown restaurant can be overheard.  Any comments the developer makes during the conversation will not be confidential.  Regardless of the client's naivety, he should also protect the client from public disclosure."], "judge explanation": ["I agree with Player 2 that the developer should have taken the client's naivety into consideration and suggested a less public venue for the meeting."], "player1 side": "for", "winner": "player2", "winner side": "against", "winner id": "0QGDL8LXCP", "player_ids": {"player1": "SAZ40YC0XM", "player2": "0QGDL8LXCP", "judge": "2V704WG0KC"}}]}, {"scenario_text": "The architect is told by a member of their firm that a third member charged excessive and inflated project cost overrun fees to several clients, but the accuser and the alleged cheater are in the middle of a divorce.", "question_text": "Using no more than 2 sentences, describe an example scenario for the architect for which it is unclear whether it can be described as having substantial information", "intended_scenario_type": "Ambiguous", "avgRating": 3.0, "PhraseID": "Q7", "rule": "Members having substantial information which leads to a reasonable belief that another Member has committed a violation of this Code which raises a serious question as to that Member’s honesty, trustworthiness, or fitness as a Member, shall file a complaint with the National Ethics Council.", "phrase": "having substantial information", "profession": "architect", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Members having substantial information which leads to a reasonable belief that another Member has committed a violation of this Code which raises a serious question as to that Member's honesty, trustworthiness, or fitness as a Member, shall file a complaint with the National Ethics Council.\" \nConsider the rule provided above. In the following scenario, are the architect's actions an example of having substantial information?\n\nScenario: The architect is told by a member of their firm that a third member charged excessive and inflated project cost overrun fees to several clients, but the accuser and the alleged cheater are in the middle of a divorce.", "profession_description": "An archtect designs buildings and in many cases also supervises their construction.", "games": [{"id": 17, "chat": [], "player1 argument": ["I feel that just because the parties involved are clearly at odds with one another since they are ending their marriage it doesn't mean that the architect who brought the allegations against his soon to be ex that it isn't true and that person has every right to bring that to someone in authority and the person who now has that information should absolut"], "player2 argument": ["The claim from the third party is hearsay and emotionally charged. The architect could ruin their own reputation by reporting this with no evidence."], "judge explanation": ["the argument for as stated by Player 1 is absolutely correct. it's unfortunate and embarrassing that this is happening under the circmumstances, but that doesn't mean the allegations should be ignored. as Player 1 said, the accusation should be made and now it will be in the hands of someone in a position to act appropriately.  i side with Player 1 (for)."], "player1 side": "for", "winner": "player1", "winner side": "for", "winner id": "AQ7YGXFYDL", "player_ids": {"player1": "AQ7YGXFYDL", "player2": "2K2XIPE56W", "judge": "11W7QK9ESI"}}]}, {"scenario_text": "The veterinarian inputs records of their patients into a computer database.", "question_text": "Using no more than 2 sentences, describe an example scenario for the veterinarian for which it is unclear whether it can be described as bettering public health", "intended_scenario_type": "Ambiguous", "avgRating": 3.75, "PhraseID": "Q34", "rule": "A veterinarian shall recognize a responsibility to participate in activities contributing to the improvement of the community and the betterment of public health.", "phrase": "bettering public health", "profession": "veterinarian", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"A veterinarian shall recognize a responsibility to participate in activities contributing to the improvement of the community and the betterment of public health.\" \nConsider the rule provided above. In the following scenario, are the veterinarian's actions an example of bettering public health?\n\nScenario: The veterinarian inputs records of their patients into a computer database.", "profession_description": "A veterinarian is a professional who practices veterinary medicine by treating diseases, disorders, and injuries in non-human animals.", "games": [{"id": 18, "chat": [], "player1 argument": ["it is not realistic to think that a veteranarian is not going to put records into a data base.  the key is, what types of records.  until or unless i knew that these were personal records, or any records that could be used in an underhanded way, i don't feel as if any wrong has been done.  the vet is running a business.  he can't be expected to do anything other than what they did."], "player2 argument": ["Per the rule. a veterinarian shall recognize a responsibility to participate in activities contributing to the improvement of the community and the betterment of public health. While inputting patient records into a computer database can seem to have some positive applications, there are also some potential pitfalls such as potential security threats depending on how secure the patient database is and technical savvy the veterinarian is.  Also, there is a potential of incorrectly inputting data which could be misinterpreted later on."], "judge explanation": ["Any physician must take into account the privacy of their patients.  It is important to keep records secure and take all precautions to prevent data breaches.  It is unclear that the vicenarian took such precautions.  So I agree with Player 2."], "player1 side": "for", "winner": "player2", "winner side": "against", "winner id": "YXEMXHD9TA", "player_ids": {"player1": "11W7QK9ESI", "player2": "YXEMXHD9TA", "judge": "D7DFHXQ55M"}}]}, {"scenario_text": "The architect makes safety videos available for his employees to watch but does not enforce that they actually adhere to them.", "question_text": "Using no more than 2 sentences, describe an example scenario for the architect for which it is unclear whether it can be described as making reasonable efforts", "intended_scenario_type": "Ambiguous", "avgRating": 2.6666666666666665, "PhraseID": "Q8", "rule": "Members shall make reasonable efforts to ensure that those over whom they have supervisory authority conform their conduct to this Code.", "phrase": "making reasonable efforts", "profession": "architect", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Members shall make reasonable efforts to ensure that those over whom they have supervisory authority conform their conduct to this Code.\" \nConsider the rule provided above. In the following scenario, are the architect's actions an example of making reasonable efforts?\n\nScenario: The architect makes safety videos available for his employees to watch but does not enforce that they actually adhere to them.", "profession_description": "An archtect designs buildings and in many cases also supervises their construction.", "games": [{"id": 19, "chat": [], "player1 argument": ["It is the architect's responsibility to ensure that their employees are safe. By failing to enforce that safety protocols are followed they have failed to follow the code."], "player2 argument": ["The architect shall make reasonable efforts to ensure that those over whom they have supervisory authority conform their conduct to this Code.  As the architect has taken the time to make safety videos available for his employees to watch, it may be the case that the employees at this architect firm are self-reliant and require minimal supervision.  As they are self-reliant and can be trusted to perform in a professional manner the architect would not need to enforce any rules, as the employees can be trusted to follow the safety guidelines outlined in the video."], "judge explanation": ["While it's likely that the majority of architects will behave in an ethical and professional manner there's always people who don't and certainly by not taking any steps to ensure any enforcement only encourages that kind of behavior in people that would be tempted so I agree with Player 1 that the employer clearly has failed to take any steps to see code of conducts are being followed."], "player1 side": "against", "winner": "player1", "winner side": "against", "winner id": "2K2XIPE56W", "player_ids": {"player1": "2K2XIPE56W", "player2": "YXEMXHD9TA", "judge": "AQ7YGXFYDL"}}]}, {"scenario_text": "The veterinarian returns the clients call.", "question_text": "Using no more than 2 sentences, describe an example scenario for the veterinarian for which it is unclear whether it can be described as being influenced by client needs", "intended_scenario_type": "Ambiguous", "avgRating": 3.3333333333333335, "PhraseID": "Q35", "rule": "A veterinarian shall be influenced only by the welfare of the patient, the needs of the client, the safety of the public, and the need to uphold the public trust vested in the veterinary profession, and shall avoid conflicts of interest or the appearance thereof.", "phrase": "being influenced by client needs", "profession": "veterinarian", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"A veterinarian shall be influenced only by the welfare of the patient, the needs of the client, the safety of the public, and the need to uphold the public trust vested in the veterinary profession, and shall avoid conflicts of interest or the appearance thereof.\" \nConsider the rule provided above. In the following scenario, are the veterinarian's actions an example of being influenced by client needs?\n\nScenario: The veterinarian returns the clients call.", "profession_description": "A veterinarian is a professional who practices veterinary medicine by treating diseases, disorders, and injuries in non-human animals.", "games": [{"id": 20, "chat": [], "player1 argument": ["Part of the veterinarian's job is attending to the client's needs which would obviously include returning any of the client's phone calls rather than simply ignoring them."], "player2 argument": ["the problem here is that the client should not have had to wait for the call to be returned.  an animal's health can change instantly; by coincidence i witnessed such an event in the past week. if the vet was not available to take the initital call,, then someone on staff should have taken the call and given an opinion.  after that, the vet can, if necessary, make their own call.  but there should have been no need for a return call when an animal may be in trouble."], "judge explanation": ["Returning the client's call is within the scope of the vet's responsibilities. There is insufficient information to make assumptions about the conditions that were occurring when the client called."], "player1 side": "for", "winner": "player1", "winner side": "for", "winner id": "2V704WG0KC", "player_ids": {"player1": "2V704WG0KC", "player2": "11W7QK9ESI", "judge": "2K2XIPE56W"}}]}, {"scenario_text": "The economic developer asked for a special meeting to discuss the city budget.", "question_text": "Using no more than 2 sentences, describe an example scenario for the professional economic developer for which it is unclear whether it can be described as bringing respect", "intended_scenario_type": "Ambiguous", "avgRating": 3.0, "PhraseID": "Q74", "rule": "Professional economic developers shall carry out their responsibilities in a manner to bring respect to the profession, the economic developer and the economic developer's constituencies.", "phrase": "bringing respect", "profession": "professional economic developer", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Professional economic developers shall carry out their responsibilities in a manner to bring respect to the profession, the economic developer and the economic developer's constituencies.\" \nConsider the rule provided above. In the following scenario, are the professional economic developer's actions an example of bringing respect?\n\nScenario: The economic developer asked for a special meeting to discuss the city budget.", "profession_description": "A professional economic developer is responsible for planning, designing, and implementing economic development strategies, as well as acting as a key liaison between public and private sectors and the community.", "games": [{"id": 21, "chat": [], "player1 argument": ["Calling for a special budget meeting fits the job description of planning, designing and implementing economic strategies, so the professional is in compliance. By calling a meeting on the matter, the developer is showing respect for and working in the best interests of his constituents and acting as a liason."], "player2 argument": ["Meetings to discuss city budget are planned well in advance with appropriate communication. By calling for a special meeting, the developer shows that they are inexperienced and unfamiliar with protocols."], "judge explanation": ["I agree with Player 1 that calling for a special budget meeting is withing the job description of the developer and is therefore showing compliance. Furthermore I agree that calling for a budget meeting is showing respect in regards to the best interests of the constituents. I give the win to Player 1."], "player1 side": "for", "winner": "player1", "winner side": "for", "winner id": "FWH0ZIZ7AI", "player_ids": {"player1": "FWH0ZIZ7AI", "player2": "2K2XIPE56W", "judge": "2V704WG0KC"}}]}, {"scenario_text": "The veterinarian decides whether or not to euthanize an animal without considering the decision of the affected families and individuals.", "question_text": "Using no more than 2 sentences, describe an example scenario for the veterinarian for which it is unclear whether it can be described as having deficient character", "intended_scenario_type": "Ambiguous", "avgRating": 2.4, "PhraseID": "Q32", "rule": "A veterinarian shall uphold the standards of professionalism, be honest in all professional interactions, and report veterinarians who are deficient in character or competence to the appropriate entities.", "phrase": "having deficient character", "profession": "veterinarian", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"A veterinarian shall uphold the standards of professionalism, be honest in all professional interactions, and report veterinarians who are deficient in character or competence to the appropriate entities.\" \nConsider the rule provided above. In the following scenario, are the veterinarian's actions an example of having deficient character?\n\nScenario: The veterinarian decides whether or not to euthanize an animal without considering the decision of the affected families and individuals.", "profession_description": "A veterinarian is a professional who practices veterinary medicine by treating diseases, disorders, and injuries in non-human animals.", "games": [{"id": 22, "chat": [], "player1 argument": ["any vet who would euthanize an animal without consulting with the people involved should probably not be in business.  animals are part of a family; the vet can't speak for the people involved. now supposing the animal is in distress and the vet thinks they are doing it for the good of the animal.  that is weak thinking. if the animal is suffering, give the animal a shot which will settle him down and let the animal sleep ...sleep, not euthanize."], "player2 argument": ["We can't assume the vet decided FOR putting the animal down as perhaps the pet was dropped off and the owner wanted the animal put down and the vet decided the animal was in good health and could not in good conscience put the animal down. Now if in fact the vet decided to put the animal down perhaps he knew there was no possible way the animal was going to make it giving the animal a sedative isn't going to change the outcome just so you can tell the family that there's no decision to really be made as the animal is in too poor health to survive."], "judge explanation": ["As per the rule, a veterinarian should uphold the standards of professionalism and be honest in all professional interactions.  A veterinarian can not independently decide to euthanize an animal without the pet's owner's written or verbal consent. It is the veterinarian's professional responsibility to have uncomfortable conversations and to be upfront and honest with the pet owner about the cost of continued care and what the consequences of not euthanizing might be. I rule for Player 1."], "player1 side": "against", "winner": "player1", "winner side": "against", "winner id": "11W7QK9ESI", "player_ids": {"player1": "11W7QK9ESI", "player2": "AQ7YGXFYDL", "judge": "YXEMXHD9TA"}}]}, {"scenario_text": "The veterinarian runs into a client at a restaurant and chats with them.", "question_text": "Using no more than 2 sentences, describe an example scenario for the veterinarian for which it is unclear whether it can be described as being influenced by client needs", "intended_scenario_type": "Ambiguous", "avgRating": 3.2, "PhraseID": "Q35", "rule": "A veterinarian shall be influenced only by the welfare of the patient, the needs of the client, the safety of the public, and the need to uphold the public trust vested in the veterinary profession, and shall avoid conflicts of interest or the appearance thereof.", "phrase": "being influenced by client needs", "profession": "veterinarian", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"A veterinarian shall be influenced only by the welfare of the patient, the needs of the client, the safety of the public, and the need to uphold the public trust vested in the veterinary profession, and shall avoid conflicts of interest or the appearance thereof.\" \nConsider the rule provided above. In the following scenario, are the veterinarian's actions an example of being influenced by client needs?\n\nScenario: The veterinarian runs into a client at a restaurant and chats with them.", "profession_description": "A veterinarian is a professional who practices veterinary medicine by treating diseases, disorders, and injuries in non-human animals.", "games": [{"id": 23, "chat": [], "player1 argument": ["If you are in someone who regularly services a client and you run into them in public it's very rude not to at least say hi and if it turns into a chat then clearly the client was happy to see the vet. It's just good business and public relations to be friendly towards your clients whenever possible."], "player2 argument": ["While a simple greeting with a client in public may be acceptable, going on to conduct a chat with them may constitute a conflict of interest.  They need to maintain professionalism at all times and avoid what may look like favoritism.  The vet can simple say hello without going into any more detail with the client."], "judge explanation": ["I tend to side with Player 1's argument for compliance. The scenario is benign, the setting a neutral place, and it seems like just good business to be friendly to a customer, as Player 1 said."], "player1 side": "for", "winner": "player1", "winner side": "for", "winner id": "AQ7YGXFYDL", "player_ids": {"player1": "AQ7YGXFYDL", "player2": "D7DFHXQ55M", "judge": "FWH0ZIZ7AI"}}]}, {"scenario_text": "The architect compliments the drawing of a competing architect.", "question_text": "Using no more than 2 sentences, describe an example scenario for the architect for which it is unclear whether it can be described as relying on advice", "intended_scenario_type": "Ambiguous", "avgRating": 3.2, "PhraseID": "Q4", "rule": "In performing professional services, members shall take into account applicable laws and regulations. Members may rely on the advice of other qualified persons as to the intent and meaning of such regulations.", "phrase": "relying on advice", "profession": "architect", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"In performing professional services, members shall take into account applicable laws and regulations. Members may rely on the advice of other qualified persons as to the intent and meaning of such regulations.\" \nConsider the rule provided above. In the following scenario, are the architect's actions an example of relying on advice?\n\nScenario: The architect compliments the drawing of a competing architect.", "profession_description": "An archtect designs buildings and in many cases also supervises their construction.", "games": [{"id": 24, "chat": [], "player1 argument": ["In this scenario the architect compliments the drawing of a competing architect. This is a professional courtesy or a show of comradery. The rules state that while performing professional services, the architect should take into account all laws ans regulation, which in this scenario no rule or regulation was broken.  It also states that one may rely on the advice of other qualified architects. In this scenario no advice was given on a simple compliment towards a competing architect."], "player2 argument": ["Since members may rely on the advice of other qualified members on regulation, the compliment could be misleading.  The architect is offering an opinion which may not serve the purpose of complying with regulation.  The architect should keep their personal opinions to themselves and only offer professional advice."], "judge explanation": ["If a complement can be in any way a bad thing, we have really reached a sad state in our world.  Even if it is misleading, that is sneaky but it doesn't violate any rule, regulation, or law. a complement is a good thing.  We should take them as they come."], "player1 side": "for", "winner": "player1", "winner side": "for", "winner id": "YXEMXHD9TA", "player_ids": {"player1": "YXEMXHD9TA", "player2": "D7DFHXQ55M", "judge": "11W7QK9ESI"}}]}, {"scenario_text": "The chemical professional works extra hours at his workplace, and those extra hours are not compensated since his salary is fixed.", "question_text": "Using no more than 2 sentences, describe an example scenario for the chemical professional  for which it is unclear whether it can be described as providing fair compensation", "intended_scenario_type": "Ambiguous", "avgRating": 2.75, "PhraseID": "Q27", "rule": "Employers should provide them with a safe, congenial working environment, fair compensation, opportunities for advancement, and properly acknowledge their scientific contributions.", "phrase": "providing fair compensation", "profession": "chemical professional", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Employers should provide them with a safe, congenial working environment, fair compensation, opportunities for advancement, and properly acknowledge their scientific contributions.\" \nConsider the rule provided above. In the following scenario, are the chemical professional's actions an example of providing fair compensation?\n\nScenario: The chemical professional works extra hours at his workplace, and those extra hours are not compensated since his salary is fixed.", "profession_description": "Chemical professionals seek to advance chemical science while striving for the highest standards of scientific integrity.", "games": [{"id": 25, "chat": [], "player1 argument": ["The rule requires that fair compensation is provided to employees and a fixed salary only covers standard working house. The chemical professional should be compensated for his time, or he should not be required to work extra hours."], "player2 argument": ["Nowhere in the scenario does it state that professional is being made to work extra hours. It could be that the professional is working extra hours of their own volition due to a passion for the project they are working on, to make up for lost hours or a mistake they made in the course of a work day/week, or attempting to show extra initiative in order to achieve advancement in their career."], "judge explanation": ["It's true...some jobs are \"salaried.\" I've had more than my share of them. But the truth is that I accepted those jobs; I knew what I was in store for.  If the employee is not happy, he can quit, or go to a labor board. But a salaried position is just that...you get your salary. No overtime."], "player1 side": "against", "winner": "player1", "winner side": "against", "winner id": "2K2XIPE56W", "player_ids": {"player1": "2K2XIPE56W", "player2": "2V704WG0KC", "judge": "D7DFHXQ55M"}}]}, {"scenario_text": "A physicist publishes a paper with mixed reactions.", "question_text": "Using no more than 2 sentences, describe an example scenario for the physicist for which it is unclear whether it can be described as causing disrepute", "intended_scenario_type": "Ambiguous", "avgRating": 2.2, "PhraseID": "Q44", "rule": "The Physicist shall act with integrity and shall not intentionally bring the Institute of Physics, or the staff or other members of the Institute, into disrepute", "phrase": "causing disrepute", "profession": "physicist", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"The Physicist shall act with integrity and shall not intentionally bring the Institute of Physics, or the staff or other members of the Institute, into disrepute\" \nConsider the rule provided above. In the following scenario, are the physicist's actions an example of causing disrepute?\n\nScenario: A physicist publishes a paper with mixed reactions.", "profession_description": "A physicist is a scientist who specializes in the field of physics, which encompasses the interactions of matter and energy at all length and time scales in the physical universe.", "games": [{"id": 26, "chat": [], "player1 argument": ["When a scientist publishes their results, it can often be met with criticism.  Simply because there are those who do not agree with the paper does not mean the physicist did not act with integrity.  After all, people once criticized other famous scientist findings in the past who turned out to be correct."], "player2 argument": ["In this scenario, a physicist publishes a paper with mixed reactions. Per the rules, the Physicist shall act with integrity and shall not intentionally bring the Institute of Physics,  or the staff or other members of the Institute, into disrepute. By publishing this paper the physicist has possibly harmed the reputation of the Institute.  The Physicist could have requested professional feedback from a colleague prior to publishing this paper which has received mixed reactions and possibly preserved the reputation of the Institute."], "judge explanation": ["I have to side with Player 1 on this. Putting out a paper that's controversial is unlikely to harm the institution. If you only put out papers you know won't receive criticism as Player 1 mentions you won't ever do any groundbreaking work and it's also shows a lack of integrity to censor papers because it might not be well received."], "player1 side": "for", "winner": "player1", "winner side": "for", "winner id": "D7DFHXQ55M", "player_ids": {"player1": "D7DFHXQ55M", "player2": "YXEMXHD9TA", "judge": "AQ7YGXFYDL"}}]}, {"scenario_text": "The librarian hangs posters about popular vacation destinations in the library.", "question_text": "Using no more than 2 sentences, describe an example scenario for the librarian for which it is unclear whether it can be described as upholding intellectual freedom", "intended_scenario_type": "Ambiguous", "avgRating": 2.3333333333333335, "PhraseID": "Q12", "rule": "We uphold the principles of intellectual freedom and resist all efforts to censor library resources.", "phrase": "upholding intellectual freedom", "profession": "librarian", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"We uphold the principles of intellectual freedom and resist all efforts to censor library resources.\" \nConsider the rule provided above. In the following scenario, are the librarian's actions an example of upholding intellectual freedom?\n\nScenario: The librarian hangs posters about popular vacation destinations in the library.", "profession_description": "A librarian is a person who works professionally in a library, providing access to information, and sometimes social or technical programming, or instruction on information literacy to users.", "games": [{"id": 28, "chat": [], "player1 argument": ["The scenario described is benign -- the librarian hasn't endorsed censorship or violated anyone's intellectual freedom. Most likely, there are libary patrons interested in knowing about vacation destinations. The librarian is making the library an appealing, colorful place by decorating it in this way."], "player2 argument": ["Librarians are supposed to uphold the principles of intellectual freedom and resist all efforts to censor library resources., however, one may ask if an advertisement is considered a library resource. The question becomes if the librarians are upholding the principles of intellectual freedom or promoting and advertising to their patrons."], "judge explanation": ["I agree with Player 1 that the posters may be of interest to library patrons and that they can make the library a more appealing and colorful place. I don't see how hanging these posters can be a violation of any freedoms or endorsing censorship in anyway. Player 1 wins."], "player1 side": "for", "winner": "player1", "winner side": "for", "winner id": "FWH0ZIZ7AI", "player_ids": {"player1": "FWH0ZIZ7AI", "player2": "YXEMXHD9TA", "judge": "2V704WG0KC"}}]}, {"scenario_text": "The Physicist contacted an ethics review committee.", "question_text": "Using no more than 2 sentences, describe an example scenario for the physicist for which it is unclear whether it can be described as presenting quality work", "intended_scenario_type": "Ambiguous", "avgRating": 3.0, "PhraseID": "Q45", "rule": "The Physicist shall exercise all reasonable due diligence, in presenting quality work to the best of their ability, by critically assessing the likelihood of experimental, methodological, systematic or human errors and avoiding bias or unfair influence.", "phrase": "presenting quality work", "profession": "physicist", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"The Physicist shall exercise all reasonable due diligence, in presenting quality work to the best of their ability, by critically assessing the likelihood of experimental, methodological, systematic or human errors and avoiding bias or unfair influence.\" \nConsider the rule provided above. In the following scenario, are the physicist's actions an example of presenting quality work?\n\nScenario: The Physicist contacted an ethics review committee.", "profession_description": "A physicist is a scientist who specializes in the field of physics, which encompasses the interactions of matter and energy at all length and time scales in the physical universe.", "games": [{"id": 29, "chat": [], "player1 argument": ["the rule clearly states that part of his job is to assess the work of other people so that there is no bias or unfair influence.  this professional has contacted the ethics review board because he believes he has seen a violation. as he should."], "player2 argument": ["I believe the rule applies to the physicist's own work, and his own responsibility to critically assess his work for any chance of error in that work. Contacting an ethics review board seems out of the bounds of doing your own critical assessment."], "judge explanation": ["In this scenario, the Physicist contacted an ethics review committee, which I feel demonstrates that the physicist is exercising all reasonable due diligence in presenting quality work and avoiding the possibility of bias or unfair influence.  As such, I feel there is no issue here and rule for Player 1."], "player1 side": "for", "winner": "player1", "winner side": "for", "winner id": "11W7QK9ESI", "player_ids": {"player1": "11W7QK9ESI", "player2": "FWH0ZIZ7AI", "judge": "YXEMXHD9TA"}}]}, {"scenario_text": "The economic developer spoke at length about some parts of the project.", "question_text": "Using no more than 2 sentences, describe an example scenario for the professional economic developer for which it is unclear whether it can be described as practicing integrity", "intended_scenario_type": "Ambiguous", "avgRating": 3.25, "PhraseID": "Q75", "rule": "Professional economic developers shall practice with integrity, honesty, and adherence to the trust placed in them both in fact and in appearance.", "phrase": "practicing integrity", "profession": "professional economic developer", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Professional economic developers shall practice with integrity, honesty, and adherence to the trust placed in them both in fact and in appearance.\" \nConsider the rule provided above. In the following scenario, are the professional economic developer's actions an example of practicing integrity?\n\nScenario: The economic developer spoke at length about some parts of the project.", "profession_description": "A professional economic developer is responsible for planning, designing, and implementing economic development strategies, as well as acting as a key liaison between public and private sectors and the community.", "games": [{"id": 30, "chat": [], "player1 argument": ["It is obviously within the scope of the developers job and in their interests to speak about the projects that they are working on."], "player2 argument": ["the issue here is that the developer spoke AT LENGTH about some PARTS of the project. who gave him the authority to do that? the more someone talks, the greater the chance that he is going to say something he will later regret."], "judge explanation": ["The scenario lacks context to call this a violation of the rule. The details of the project ARE the developers job, and speaking about the project is a way of keeping people informed. Player 1 wins I think."], "player1 side": "for", "winner": "player1", "winner side": "for", "winner id": "2V704WG0KC", "player_ids": {"player1": "2V704WG0KC", "player2": "11W7QK9ESI", "judge": "FWH0ZIZ7AI"}}]}, {"scenario_text": "A wildlife professional does not know whether to show all the results or show only what he thinks supports his hypothesis.", "question_text": "Using no more than 2 sentences, describe an example scenario for the wildlife professional for which it is unclear whether it can be described as suppressing results", "intended_scenario_type": "Ambiguous", "avgRating": 2.75, "PhraseID": "Q70", "rule": "Refrain from fabrication, falsification, or suppression of results, and shall not deliberately misrepresent research findings, or otherwise commit scientific fraud.", "phrase": "suppressing results", "profession": "wildlife professional", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Refrain from fabrication, falsification, or suppression of results, and shall not deliberately misrepresent research findings, or otherwise commit scientific fraud.\" \nConsider the rule provided above. In the following scenario, are the wildlife professional's actions an example of suppressing results?\n\nScenario: A wildlife professional does not know whether to show all the results or show only what he thinks supports his hypothesis.", "profession_description": "Wildlife professionals are scientists that observe and study the behaviors of animals. They frequently observe the features of certain wildlife and determine the creatures' role in specific ecosystems and/or how they interact with human beings. In addition, they will often perform various experiments to either increase our knowledge about a certain species or see how humans influence the ecosystem in question.", "games": [{"id": 31, "chat": [], "player1 argument": ["This is a clear violation of the rules. All data should be included. A hypothesis is just--the evidence may end up contradicting it. This is science, and a scientist should let the process play itself out."], "player2 argument": ["They are not violating the rules, since none of the presented reasons are false, fabrication or suppression of truth. They are truths,  but only ones that follow his opinions."], "judge explanation": ["As per the rule, a wildlife professional should refrain from suppression of results. So, he must disclose all the results."], "player1 side": "against", "winner": "player1", "winner side": "against", "winner id": "SAZ40YC0XM", "player_ids": {"player1": "SAZ40YC0XM", "player2": "ZO1P6Y0NG6", "judge": "ZD9T3CHAL1"}}]}, {"scenario_text": "An elected high-ranking state officer runs for a second term.", "question_text": "Using no more than 2 sentences, describe an example scenario for the state officer for which it is unclear whether it can be described as being consistent with the public interest", "intended_scenario_type": "Ambiguous", "avgRating": 3.75, "PhraseID": "Q18", "rule": "A State Officer should not make personal investments that could reasonably be expected to create a substantial conflict between the officer’s or employee’s private interest and the public interest", "phrase": "being consistent with the public interest", "profession": "state officer", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"A State Officer should not make personal investments that could reasonably be expected to create a substantial conflict between the officer's or employee's private interest and the public interest\" \nConsider the rule provided above. In the following scenario, are the state officer's actions an example of being consistent with the public interest?\n\nScenario: An elected high-ranking state officer runs for a second term.", "profession_description": "State officer means a person who is duly elected, appointed or retained through election to any state office, or a member of any state board, commission or council, and includes a member of the legislature.", "games": [{"id": 32, "chat": [], "player1 argument": ["The State Officer has committed no impropriety here. Running for a second term is within their rights and does not conflict with any rules regarding conflict of financial interest."], "player2 argument": ["The officer should make all of his personal investment information available for the public to review. If he is not in conflict with the rules he should have not problem allowing access to this information."], "judge explanation": ["The rule prohibits investments, but the scenario doesn't involve any. The For is correct."], "player1 side": "for", "winner": "player1", "winner side": "for", "winner id": "XD9MUS9CLI", "player_ids": {"player1": "XD9MUS9CLI", "player2": "RL1STZYNEE", "judge": "SAZ40YC0XM"}}]}, {"scenario_text": "The professional briefly described to the interviewer why another professional’s results should be deemed unusable.", "question_text": "Using no more than 2 sentences, describe an example scenario for the chemical professional for which it is unclear whether it can be described as making public comments", "intended_scenario_type": "Ambiguous", "avgRating": 3.6666666666666665, "PhraseID": "Q26", "rule": "Public comments on scientific matters should be made with care and accuracy, without unsubstantiated, exaggerated, or premature statements.", "phrase": "making public comments", "profession": "chemical professional", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Public comments on scientific matters should be made with care and accuracy, without unsubstantiated, exaggerated, or premature statements.\" \nConsider the rule provided above. In the following scenario, are the chemical professional's actions an example of making public comments?\n\nScenario: The professional briefly described to the interviewer why another professional's results should be deemed unusable.", "profession_description": "Chemical professionals seek to advance chemical science while striving for the highest standards of scientific integrity.", "games": [{"id": 33, "chat": [], "player1 argument": ["Because the professional only briefly described why the results should be considered unusable without going into full detail seems a bit reckless and without care for full accuracy and consideration. This is an accusation which should only have been made thoughtfully and carefully, rather than so flippantly."], "player2 argument": ["In describing why the results were unusable, the professional must have good reason to do so. In this case, the professional may be acting to prevent a hazard to the public because he knows the experimental setup and results are flawed. We cannot presume that the professional made his remarks flippantly. It may be a serious interview. SO he is acting in good faith"], "judge explanation": ["The briefness of the professional does not give his opinion the needed care and accuracy required, and we don't know of the other accuracy either."], "player1 side": "against", "winner": "player1", "winner side": "against", "winner id": "2V704WG0KC", "player_ids": {"player1": "2V704WG0KC", "player2": "FWH0ZIZ7AI", "judge": "ZO1P6Y0NG6"}}]}, {"scenario_text": "The economic developer spoke at length about some parts of the project.", "question_text": "Using no more than 2 sentences, describe an example scenario for the professional economic developer for which it is unclear whether it can be described as practicing integrity", "intended_scenario_type": "Ambiguous", "avgRating": 3.25, "PhraseID": "Q75", "rule": "Professional economic developers shall practice with integrity, honesty, and adherence to the trust placed in them both in fact and in appearance.", "phrase": "practicing integrity", "profession": "professional economic developer", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Professional economic developers shall practice with integrity, honesty, and adherence to the trust placed in them both in fact and in appearance.\" \nConsider the rule provided above. In the following scenario, are the professional economic developer's actions an example of practicing integrity?\n\nScenario: The economic developer spoke at length about some parts of the project.", "profession_description": "A professional economic developer is responsible for planning, designing, and implementing economic development strategies, as well as acting as a key liaison between public and private sectors and the community.", "games": [{"id": 34, "chat": [], "player1 argument": ["The economic developer should practice with integrity, honesty, and adherence to the trust placed in them and should not disclose any confidential kind of information. The economic developer spoke at length about some parts of the project is definitely in violation of the above rule."], "player2 argument": ["Speaking at length on a project does not mean they violated integrity, honesty and adherence rules. It just means they were descriptive, on completely valid ideas."], "judge explanation": ["As a liason between \"public, private sectors and the community\", it is part of the economic developer's job to inform all parties about projects. There was no indication that any information discussed was confidential.  Player 2's argument wins."], "player1 side": "against", "winner": "player2", "winner side": "for", "winner id": "ZO1P6Y0NG6", "player_ids": {"player1": "ZD9T3CHAL1", "player2": "ZO1P6Y0NG6", "judge": "0QGDL8LXCP"}}]}, {"scenario_text": "The physicist in medicine describes the peer reviewed paper as being written at a high school level.", "question_text": "Using no more than 2 sentences, describe an example scenario for the physicist in medicine for which it is unclear whether it can be described as making derogatory critiques", "intended_scenario_type": "Ambiguous", "avgRating": 3.25, "PhraseID": "Q24", "rule": "The editor is responsible for ensuring that the peer review process of the journal is objective and fair, and that reviews do not contain derogatory critiques or disparaging remarks.", "phrase": "making derogatory critiques", "profession": "physicist in medicine", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"The editor is responsible for ensuring that the peer review process of the journal is objective and fair, and that reviews do not contain derogatory critiques or disparaging remarks.\" \nConsider the rule provided above. In the following scenario, are the physicist in medicine's actions an example of making derogatory critiques?\n\nScenario: The physicist in medicine describes the peer reviewed paper as being written at a high school level.", "profession_description": "A physicist in medicine is a professional who applies the principles and methods of both physics and medicine. They focus on the areas of prevention, diagnosis, and treatment, as well as ensuring quality services and prevention of risks to the patients, and members of the public in general.", "games": [{"id": 35, "chat": [], "player1 argument": ["While critiques are obviously fine and necessary, a part of the job, describing a paper as \"written by a high school student\" seems unnecessarily derogatory and far less disparaging language should have been used. The critique, the way it was made, seems incredibly unprofessional."], "player2 argument": ["It is not necessarily disparaging to describe an article as using language on a high school level; if he had said 3rd grade level, that would be an attack. If he is describing the language level accurately, he may be saying the article can be understood by the general public, which is not an insult and means the article is valuable to the public."], "judge explanation": ["The physicist's job is to use principles and methods to convey information about prevention, diagnosis, and treatments. The critique that was left was disparaging and the physicist should take that up with the editor of the journal instead of airing his grievances in public. Player 1's argument wins."], "player1 side": "against", "winner": "player1", "winner side": "against", "winner id": "2V704WG0KC", "player_ids": {"player1": "2V704WG0KC", "player2": "FWH0ZIZ7AI", "judge": "RL1STZYNEE"}}]}, {"scenario_text": "The physicist helps an intern complete his experiment for his senior class project.", "question_text": "Using no more than 2 sentences, describe an example scenario for the physicist for which it is unclear whether it can be described as presenting quality work", "intended_scenario_type": "Ambiguous", "avgRating": 3.6666666666666665, "PhraseID": "Q45", "rule": "The Physicist shall exercise all reasonable due diligence, in presenting quality work to the best of their ability, by critically assessing the likelihood of experimental, methodological, systematic or human errors and avoiding bias or unfair influence.", "phrase": "presenting quality work", "profession": "physicist", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"The Physicist shall exercise all reasonable due diligence, in presenting quality work to the best of their ability, by critically assessing the likelihood of experimental, methodological, systematic or human errors and avoiding bias or unfair influence.\" \nConsider the rule provided above. In the following scenario, are the physicist's actions an example of presenting quality work?\n\nScenario: The physicist helps an intern complete his experiment for his senior class project.", "profession_description": "A physicist is a scientist who specializes in the field of physics, which encompasses the interactions of matter and energy at all length and time scales in the physical universe.", "games": [{"id": 37, "chat": [], "player1 argument": ["While grossly unethical, this behavior doesn't technically break the rule. The rule has to do with the integrity of the physicist's work. The integrity of the intern's is ruined, but not the physicist's work,"], "player2 argument": ["The physicist has not exercised reasonable due diligence in helping an intern complete a class project. The physicist has influenced a project that has another person's name attached to it. This is highly unethical."], "judge explanation": ["I think the first argument works better as an argument against than for compliance. The physicist violated integrity by influencing the intern's work, so Player 2 wins."], "player1 side": "for", "winner": "player2", "winner side": "against", "winner id": "RL1STZYNEE", "player_ids": {"player1": "SAZ40YC0XM", "player2": "RL1STZYNEE", "judge": "FWH0ZIZ7AI"}}]}, {"scenario_text": "The staff cleans the animal areas in moderation.", "question_text": "Using no more than 2 sentences, describe an example scenario for the zoo and aquarium professional for which it is unclear whether it can be described as maintaining the high standard of husbandry and welfare", "intended_scenario_type": "Ambiguous", "avgRating": 3.4, "PhraseID": "Q19", "rule": "Members will ensure institutions receiving animals have appropriate facilities to hold the animals and skilled staff who are capable of maintaining the same high standard of husbandry and welfare as required of WAZA members.", "phrase": "maintaining the high standard of husbandry and welfare", "profession": "zoo and aquarium professional", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Members will ensure institutions receiving animals have appropriate facilities to hold the animals and skilled staff who are capable of maintaining the same high standard of husbandry and welfare as required of WAZA members.\" \nConsider the rule provided above. In the following scenario, are the zoo and aquarium professional's actions an example of maintaining the high standard of husbandry and welfare?\n\nScenario: The staff cleans the animal areas in moderation.", "profession_description": "Zoo and Aquarium professionals seek to maintain the health and well-being of animals under their care.", "games": [{"id": 38, "chat": [], "player1 argument": ["The staff cleans the animal area in moderation while the skilled staff is required to maintain the same HIGH standard of husbandry and welfare as required by QAZA members. The requirement is not fulfilled here."], "player2 argument": ["Moderation does not mean failure of requirements as required by WAZA. It is adequate enough to meet standards, while not being excessive or lacking."], "judge explanation": ["The \"staff\" must meet the WAZA requirements of being a \"Skilled staff\". As \"skilled staff\" is the standard to be upheld and the \"staff\" fulfills the requirement by keeping the areas clean, if only through moderate work, they have still met the standard. Player 2's argument wins."], "player1 side": "against", "winner": "player2", "winner side": "for", "winner id": "ZO1P6Y0NG6", "player_ids": {"player1": "ZD9T3CHAL1", "player2": "ZO1P6Y0NG6", "judge": "XD9MUS9CLI"}}]}, {"scenario_text": "An architect tries to get good results in his project but instead gets distracted with another task.", "question_text": "Using no more than 2 sentences, describe an example scenario for the architect for which it is unclear whether it can be described as respecting professional contributions", "intended_scenario_type": "Ambiguous", "avgRating": 2.3333333333333335, "PhraseID": "Q9", "rule": "Members shall recognize and respect the professional contributions of their employees, employers, professional colleagues, and business associates.", "phrase": "respecting professional contributions", "profession": "architect", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Members shall recognize and respect the professional contributions of their employees, employers, professional colleagues, and business associates.\" \nConsider the rule provided above. In the following scenario, are the architect's actions an example of respecting professional contributions?\n\nScenario: An architect tries to get good results in his project but instead gets distracted with another task.", "profession_description": "An archtect designs buildings and in many cases also supervises their construction.", "games": [{"id": 39, "chat": [], "player1 argument": ["By failing to do his best--and for a reason entirely within his control--he failed to show respect for the work done by employees, and his willfully subpar performance is something of an insult to the profession itself, not to mention the client who has every reason to expect the best effort."], "player2 argument": ["Architects work as members of a team, each of whom provides important contributions.  This architect was working on one project while allowing his team members to exercise their skills on the other project.  The architect was not irresponsible, simply managing his/her time."], "judge explanation": ["Ruling for Player 2. The rule states that the members should respect the professional contributions of their colleagues and other business associates. The scenario indicates the architect was distracted by another task, which could very well be another work project. Multitasking in a work environment can be expected."], "player1 side": "against", "winner": "player2", "winner side": "for", "winner id": "0QGDL8LXCP", "player_ids": {"player1": "SAZ40YC0XM", "player2": "0QGDL8LXCP", "judge": "YXEMXHD9TA"}}]}, {"scenario_text": "In order to make sure that they receive a varied range of demographics for applications the professional economic developers began enforcing a quota for applications of certain demographic groups.", "question_text": "Using no more than 2 sentences, describe an example scenario for the professional economic developer for which it is unclear whether it can be described as assuring equality of opportunity", "intended_scenario_type": "Ambiguous", "avgRating": 3.6666666666666665, "PhraseID": "Q77", "rule": "Professional economic developers shall assure that all economic development activities are conducted with equality of opportunity for all segments of the community without regard to race, religion, sex, sexual orientation, national origin, political affiliation, disability, age, marital status, or socioeconomic status.", "phrase": "assuring equality of opportunity", "profession": "professional economic developer", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Professional economic developers shall assure that all economic development activities are conducted with equality of opportunity for all segments of the community without regard to race, religion, sex, sexual orientation, national origin, political affiliation, disability, age, marital status, or socioeconomic status.\" \nConsider the rule provided above. In the following scenario, are the professional economic developer's actions an example of assuring equality of opportunity?\n\nScenario: In order to make sure that they receive a varied range of demographics for applications the professional economic developers began enforcing a quota for applications of certain demographic groups.", "profession_description": "A professional economic developer is responsible for planning, designing, and implementing economic development strategies, as well as acting as a key liaison between public and private sectors and the community.", "games": [{"id": 40, "chat": [], "player1 argument": ["The rule states the professional economic developer shall assure that all development activities are conducted with equality of oppurtunity for all segments of the community. By creating artifical demographic quotas you making a one size fits all solution without really doing any preliminary research to effectively"], "player2 argument": ["In fact, the developer is complying with the rule by ensuring equal opportunity. If some demographic segments are underrepresented, installing a quota on applications from those demographics helps ensure access to all. Moreover, this is only increasing applications by demographics that were underrepresented, not showing favoritism in the hiring decision. The rule is not broken."], "judge explanation": ["The duty of an economic developer is to make sure that all economic development activities are conducted with equality of opportunity for all segments. For doing so if he/she has to introduce quota or something else is perfectly fine. There is nothing wrong here by introducing quota to get better results. Player 2 wins."], "player1 side": "against", "winner": "player2", "winner side": "for", "winner id": "FWH0ZIZ7AI", "player_ids": {"player1": "YXEMXHD9TA", "player2": "FWH0ZIZ7AI", "judge": "ZD9T3CHAL1"}}]}, {"scenario_text": "The librarian has a limited rare books budget, and chooses to purchase a rare copy of the Bible instead of a rare copy of Mein Kampf.", "question_text": "Using no more than 2 sentences, describe an example scenario for the librarian for which it is unclear whether it can be described as upholding intellectual freedom", "intended_scenario_type": "Ambiguous", "avgRating": 2.6666666666666665, "PhraseID": "Q12", "rule": "We uphold the principles of intellectual freedom and resist all efforts to censor library resources.", "phrase": "upholding intellectual freedom", "profession": "librarian", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"We uphold the principles of intellectual freedom and resist all efforts to censor library resources.\" \nConsider the rule provided above. In the following scenario, are the librarian's actions an example of upholding intellectual freedom?\n\nScenario: The librarian has a limited rare books budget, and chooses to purchase a rare copy of the Bible instead of a rare copy of Mein Kampf.", "profession_description": "A librarian is a person who works professionally in a library, providing access to information, and sometimes social or technical programming, or instruction on information literacy to users.", "games": [{"id": 41, "chat": [], "player1 argument": ["No censorship has taken place here. Presumably, standard edition copies of both the Bible and Mein Kampf are available in the library for patrons to read.  The librarian has simply chosen how to allocate the limited *rare edition* book budget."], "player2 argument": ["In the scenario, the librarian has a limited rare books budget and chooses to purchase a rare copy of the Bible instead of a rare copy of Mein Kampf. Per the rule, the library is to uphold the principles of intellectual freedom and resist all efforts to censor library resources. I seriously doubt the library is missing a copy of the bible (though it may not be rare), however, Mein Kampf is probably not available at that branch as it is not a highly circulated book and in some cases is banned. So if the library truly wants to uphold intellectual freedom they will purchase the copy of Mein Kampf."], "judge explanation": ["If we agree purchasing a Bible instead of Mein Kampf is censorship, then the library has also \"censored\" scores of other rare books they could have purchased. The library has a right to allocate resources."], "player1 side": "for", "winner": "player1", "winner side": "for", "winner id": "0QGDL8LXCP", "player_ids": {"player1": "0QGDL8LXCP", "player2": "YXEMXHD9TA", "judge": "SAZ40YC0XM"}}]}, {"scenario_text": "The realtor shows a house that had foundation issues.", "question_text": "Using no more than 2 sentences, describe an example scenario for the realtor for which it is unclear whether it can be described as presenting a true picture", "intended_scenario_type": "Ambiguous", "avgRating": 3.0, "PhraseID": "Q50", "rule": "Realtors shall be honest and truthful in their real estate communications and shall present a true picture in their advertising, marketing, and other representations. Realtors shall ensure that their status as real estate professionals is readily apparent in their advertising, marketing, and other representations, and that the recipients of all real estate communications are, or have been, notified that those communications are from a real estate professional.", "phrase": "presenting a true picture", "profession": "realtor", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Realtors shall be honest and truthful in their real estate communications and shall present a true picture in their advertising, marketing, and other representations. Realtors shall ensure that their status as real estate professionals is readily apparent in their advertising, marketing, and other representations, and that the recipients of all real estate communications are, or have been, notified that those communications are from a real estate professional.\" \nConsider the rule provided above. In the following scenario, are the realtor's actions an example of presenting a true picture?\n\nScenario: The realtor shows a house that had foundation issues.", "profession_description": "A realtor acts as an agent for the sale and purchase of buildings and land.", "games": [{"id": 42, "chat": [], "player1 argument": ["So long as the realtor is honest and open about the foundation issues of the property to the buyer in question, I see no issue with showing the house provided that all issues are disclosed at the time of showing."], "player2 argument": ["If the realtor had disclosed the foundational issues, the realtor would have met the standard of \"honest and truthful\". However, no indication has been given that the realtor has made any indication that the house has problems with it's foundation. There is no proof that the realtor has made any such disclosure."], "judge explanation": ["The act of showing the house is not in violation of any rule or \"true picture\". Violation would be not disclosing such information. Because the scenario does not show that, no violation has been committed."], "player1 side": "for", "winner": "player1", "winner side": "for", "winner id": "2V704WG0KC", "player_ids": {"player1": "2V704WG0KC", "player2": "XD9MUS9CLI", "judge": "ZO1P6Y0NG6"}}]}, {"scenario_text": "The teacher spends class time in such a way that students tend to like her.", "question_text": "Using no more than 2 sentences, describe an example scenario for the teacher for which it is unclear whether it can be described as upholding reputation", "intended_scenario_type": "Ambiguous", "avgRating": 3.0, "PhraseID": "Q68", "rule": "Teachers should uphold the reputation and standing of the profession", "phrase": "upholding reputation", "profession": "teacher", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Teachers should uphold the reputation and standing of the profession\" \nConsider the rule provided above. In the following scenario, are the teacher's actions an example of upholding reputation?\n\nScenario: The teacher spends class time in such a way that students tend to like her.", "profession_description": "A teacher is a person who teaches, especially in a school.", "games": [{"id": 43, "chat": [], "player1 argument": ["The rule is for the teacher to uphold the standing and reputation of the profession. In the scenario, the teacher spends class time in a way that students tend to like her. If the teacher's class likes her, they are more likely to be attentive or engaged in her class which is a positive."], "player2 argument": ["In my experience if a teacher is very well liked by their students it probably means that some of that class time is spent allowing the students free time where they can socialize. A teacher that runs a strict and disciplined classroom is usually not at the top of the list for well liked teachers."], "judge explanation": ["This is a tough one because we don't know what sort of activities \"made the students like her\". But I think Player 2's example cast some doubt on the idea that all of these are good and would uphold the reputation of the profession."], "player1 side": "for", "winner": "player2", "winner side": "against", "winner id": "RL1STZYNEE", "player_ids": {"player1": "YXEMXHD9TA", "player2": "RL1STZYNEE", "judge": "0QGDL8LXCP"}}]}, {"scenario_text": "The fundraising professional donates money to a charity they are organizing.", "question_text": "Using no more than 2 sentences, describe an example scenario for the fundraising professional for which it is unclear whether it can be described as prioritizing philanthropic mission", "intended_scenario_type": "Ambiguous", "avgRating": 2.6666666666666665, "PhraseID": "Q37", "rule": "The Fundraising Professional will put philanthropic mission above personal gain", "phrase": "prioritizing philanthropic mission", "profession": "fundraising professional ", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"The Fundraising Professional will put philanthropic mission above personal gain\" \nConsider the rule provided above. In the following scenario, are the fundraising professional 's actions an example of prioritizing philanthropic mission?\n\nScenario: The fundraising professional donates money to a charity they are organizing.", "profession_description": "A fundraising professional specialises in recruiting quality donors for charities to support their cause and engage with them for years to come.", "games": [{"id": 44, "chat": [], "player1 argument": ["The donation gesture made by the fundraising professional is amazing and incredible. He himself set an example by making a donation. I think he has upheld the rule where it states that \"The Fundraising Professional will put philanthropic mission above personal gain\". This is a great gesture by the fundraiser and should be pr"], "player2 argument": ["The fundraising professional has a self-interest in having their own charity succeed. Therefore, there is a conflict of interest in that the professional is making a contribution which contributes to their own gain and benefit."], "judge explanation": ["The fundraising professional is organizing the charity. No where does it state that they are a recipient of funds or benefits that the charity hands out. It is not unethical for the professional to join in and donate to the cause. The first argument wins."], "player1 side": "for", "winner": "player1", "winner side": "for", "winner id": "ZD9T3CHAL1", "player_ids": {"player1": "ZD9T3CHAL1", "player2": "XD9MUS9CLI", "judge": "RL1STZYNEE"}}]}, {"scenario_text": "An insurance professional sells an insurance policy to an individual.", "question_text": "Using no more than 2 sentences, describe an example scenario for the insurance professional for which it is unclear whether it can be described as engaging in bad faith misconduct", "intended_scenario_type": "Ambiguous", "avgRating": 2.3333333333333335, "PhraseID": "Q47", "rule": "The Insurance Professional shall not have engaged in intentional, bad faith misconduct which is detrimental to IAIP at IAIP's sole determination", "phrase": "engaging in bad faith misconduct", "profession": "insurance professional ", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"The Insurance Professional shall not have engaged in intentional, bad faith misconduct which is detrimental to IAIP at IAIP's sole determination\" \nConsider the rule provided above. In the following scenario, are the insurance professional 's actions an example of engaging in bad faith misconduct?\n\nScenario: An insurance professional sells an insurance policy to an individual.", "profession_description": "An insurance professional is trained in risk analysis, which involves evaluating risk exposure to measure the potential losses to individuals and businesses. They can recommend appropriate insurance coverage and perhaps reveal risk exposures. Insurance professionals are knowledgeable about the insurance options available to their clients, and can advise on insurance related purchases.", "games": [{"id": 45, "chat": [], "player1 argument": ["The insurance professional has sold an insurance policy to a person, which is what their job is. No bad faith misconduct or", "intentional misconduct has taken place"], "player2 argument": ["The description of this type of insurance professional states that they are allowed to recommend coverage, reveal possible exposure, and \"advise\" on insurance purchases. It does not state that they are able to complete the sell of an insurance policy."], "judge explanation": ["I cannot see how selling an insurance policy to an individual is an example of intentional misconduct but rather completing the professionals job. Therefore, I have to agree with Player 1 and give them the win."], "player1 side": "for", "winner": "player1", "winner side": "for", "winner id": "ZO1P6Y0NG6", "player_ids": {"player1": "ZO1P6Y0NG6", "player2": "RL1STZYNEE", "judge": "2V704WG0KC"}}]}, {"scenario_text": "An intern helps to design habitats for animals at the zoo and aquarium.", "question_text": "Using no more than 2 sentences, describe an example scenario for the zoo and aquarium professional for which it is unclear whether it can be described as maintaining the high standard of husbandry and welfare", "intended_scenario_type": "Ambiguous", "avgRating": 2.6666666666666665, "PhraseID": "Q19", "rule": "Members will ensure institutions receiving animals have appropriate facilities to hold the animals and skilled staff who are capable of maintaining the same high standard of husbandry and welfare as required of WAZA members.", "phrase": "maintaining the high standard of husbandry and welfare", "profession": "zoo and aquarium professional", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Members will ensure institutions receiving animals have appropriate facilities to hold the animals and skilled staff who are capable of maintaining the same high standard of husbandry and welfare as required of WAZA members.\" \nConsider the rule provided above. In the following scenario, are the zoo and aquarium professional's actions an example of maintaining the high standard of husbandry and welfare?\n\nScenario: An intern helps to design habitats for animals at the zoo and aquarium.", "profession_description": "Zoo and Aquarium professionals seek to maintain the health and well-being of animals under their care.", "games": [{"id": 46, "chat": [], "player1 argument": ["The key word here is 'help'. The intern, fresh out of college or whatever, can help the skilled staff design a habitat meeting high standards by contributing their ideas. The intern isn't doing this vital task independently but merely offering their labor and skills, so no rule is broken. The intern is probably very up to date on those standards too"], "player2 argument": ["An intern is someone who is learning. It is clearly mentioned that \"skilled staff\" is required to maintain a high standard of husbandry and welfare as required of WAZA members.\n\nOnly skilled staff can ensure that the highest standards are met. Here, high standards are mandatory to maintain."], "judge explanation": ["In the scenario it the intern is helping to design habitats for animals at the zoo and aquarium. Generally, interns are supervised by senior staff so it would be reasonably expected that someone would follow up and verify the quality of the work in a professional environment. So I rule for Player 1."], "player1 side": "for", "winner": "player1", "winner side": "for", "winner id": "FWH0ZIZ7AI", "player_ids": {"player1": "FWH0ZIZ7AI", "player2": "ZD9T3CHAL1", "judge": "YXEMXHD9TA"}}]}, {"scenario_text": "The architect was told that another member had stolen from them.", "question_text": "Using no more than 2 sentences, describe an example scenario for the architect for which it is unclear whether it can be described as having substantial information", "intended_scenario_type": "Ambiguous", "avgRating": 2.3333333333333335, "PhraseID": "Q7", "rule": "Members having substantial information which leads to a reasonable belief that another Member has committed a violation of this Code which raises a serious question as to that Member’s honesty, trustworthiness, or fitness as a Member, shall file a complaint with the National Ethics Council.", "phrase": "having substantial information", "profession": "architect", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Members having substantial information which leads to a reasonable belief that another Member has committed a violation of this Code which raises a serious question as to that Member's honesty, trustworthiness, or fitness as a Member, shall file a complaint with the National Ethics Council.\" \nConsider the rule provided above. In the following scenario, are the architect's actions an example of having substantial information?\n\nScenario: The architect was told that another member had stolen from them.", "profession_description": "An archtect designs buildings and in many cases also supervises their construction.", "games": [{"id": 47, "chat": [], "player1 argument": ["In the scenario, the architect was told that another member had stolen from them. I am arguing against this conduct because the rules state that a complaint like this should be filed with the National Ethics Council. This is likely so a thorough investigation can occur. What occurred in this scenario could cause unnecessary tension based on rumors."], "player2 argument": ["Since the architect has been told that another member has stolen from them - qualifies for substantial information which leads to a reasonable belief that another Member has committed a violation of this Code. The rule states that the member SHALL file a complaint. \n\nSo this should be filed with the National Ethics Council."], "judge explanation": ["I'm confused as to the position of the 2nd argument; it seems to reiterate the first argument. The architect who was told about the theft hasn't done anything wrong but the scenario doesn't state whether they followed up. I really am undecided but must vote so I will vote for the counter argument since the architect didn't violate a rule."], "player1 side": "against", "winner": "player2", "winner side": "for", "winner id": "ZD9T3CHAL1", "player_ids": {"player1": "YXEMXHD9TA", "player2": "ZD9T3CHAL1", "judge": "FWH0ZIZ7AI"}}]}]