[{"scenario_text": "An economic developer refuses to rent a space to a black man trying to open a barber shop.", "question_text": "Using no more than 2 sentences, describe an example scenario for the professional economic developer for which it is unclear whether it can be described as assuring equality of opportunity", "intended_scenario_type": "Ambiguous", "avgRating": 3.0, "PhraseID": "Q77", "rule": "Professional economic developers shall assure that all economic development activities are conducted with equality of opportunity for all segments of the community without regard to race, religion, sex, sexual orientation, national origin, political affiliation, disability, age, marital status, or socioeconomic status.", "phrase": "assuring equality of opportunity", "profession": "professional economic developer", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Professional economic developers shall assure that all economic development activities are conducted with equality of opportunity for all segments of the community without regard to race, religion, sex, sexual orientation, national origin, political affiliation, disability, age, marital status, or socioeconomic status.\" \nConsider the rule provided above. In the following scenario, are the professional economic developer's actions an example of assuring equality of opportunity?\n\nScenario: An economic developer refuses to rent a space to a black man trying to open a barber shop."}, {"scenario_text": "In order to make sure that they receive a varied range of demographics for applications the professional economic developers began enforcing a quota for applications of certain demographic groups.", "question_text": "Using no more than 2 sentences, describe an example scenario for the professional economic developer for which it is unclear whether it can be described as assuring equality of opportunity", "intended_scenario_type": "Ambiguous", "avgRating": 3.6666666666666665, "PhraseID": "Q77", "rule": "Professional economic developers shall assure that all economic development activities are conducted with equality of opportunity for all segments of the community without regard to race, religion, sex, sexual orientation, national origin, political affiliation, disability, age, marital status, or socioeconomic status.", "phrase": "assuring equality of opportunity", "profession": "professional economic developer", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Professional economic developers shall assure that all economic development activities are conducted with equality of opportunity for all segments of the community without regard to race, religion, sex, sexual orientation, national origin, political affiliation, disability, age, marital status, or socioeconomic status.\" \nConsider the rule provided above. In the following scenario, are the professional economic developer's actions an example of assuring equality of opportunity?\n\nScenario: In order to make sure that they receive a varied range of demographics for applications the professional economic developers began enforcing a quota for applications of certain demographic groups."}, {"scenario_text": "A chemist competing with another for research funds spends a lot of time acquiring information about the funding agency.", "question_text": "Using no more than 2 sentences, describe an example scenario for the chemist for which it is unclear whether it can be described as using only honorable means", "intended_scenario_type": "Ambiguous", "avgRating": 3.3333333333333335, "PhraseID": "Q14", "rule": "To use only honorable means of competition for professional employment,; to advertise only in a dignified and factual manner; to refrain from unfairly injuring, directly or indirectly, the professional reputation, prospects, or business of a fellow Chemist, or attempting to supplant a fellow chemist already selected for employment; to perform services for a client only at rates that fairly reflect costs of equipment, supplies, and overhead expenses as well as fair personal compensation;", "phrase": "using only honorable means", "profession": "chemist", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"To use only honorable means of competition for professional employment,; to advertise only in a dignified and factual manner; to refrain from unfairly injuring, directly or indirectly, the professional reputation, prospects, or business of a fellow Chemist, or attempting to supplant a fellow chemist already selected for employment; to perform services for a client only at rates that fairly reflect costs of equipment, supplies, and overhead expenses as well as fair personal compensation;\" \nConsider the rule provided above. In the following scenario, are the chemist's actions an example of using only honorable means?\n\nScenario: A chemist competing with another for research funds spends a lot of time acquiring information about the funding agency."}, {"scenario_text": "The health physicist releases their findings from a study that they consistently faced difficulty replicating results for in hopes of other researchers studying the results further.", "question_text": "Using no more than 2 sentences, describe an example scenario for the health physicist for which it is unclear whether it can be described as reflecting sound scientific basis", "intended_scenario_type": "Ambiguous", "avgRating": 3.3333333333333335, "PhraseID": "Q42", "rule": "Professional statements made by Health Physicists shall have sound scientific basis.", "phrase": "reflecting sound scientific basis", "profession": "health physicist ", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Professional statements made by Health Physicists shall have sound scientific basis.\" \nConsider the rule provided above. In the following scenario, are the health physicist 's actions an example of reflecting sound scientific basis?\n\nScenario: The health physicist releases their findings from a study that they consistently faced difficulty replicating results for in hopes of other researchers studying the results further."}, {"scenario_text": "A state officer makes sure to eat healthy, and to stay in shape.", "question_text": "Using no more than 2 sentences, describe an example scenario for the state officer for which it is unclear whether it can be described as being consistent with the public interest", "intended_scenario_type": "Ambiguous", "avgRating": 3.5, "PhraseID": "Q18", "rule": "A State Officer should not make personal investments that could reasonably be expected to create a substantial conflict between the officer’s or employee’s private interest and the public interest", "phrase": "being consistent with the public interest", "profession": "state officer", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"A State Officer should not make personal investments that could reasonably be expected to create a substantial conflict between the officer's or employee's private interest and the public interest\" \nConsider the rule provided above. In the following scenario, are the state officer's actions an example of being consistent with the public interest?\n\nScenario: A state officer makes sure to eat healthy, and to stay in shape."}, {"scenario_text": "A state officer shares unconventional ideas in a public forum.", "question_text": "Using no more than 2 sentences, describe an example scenario for the state officer for which it is unclear whether it can be described as being consistent with the public interest", "intended_scenario_type": "Ambiguous", "avgRating": 3.5, "PhraseID": "Q18", "rule": "A State Officer should not make personal investments that could reasonably be expected to create a substantial conflict between the officer’s or employee’s private interest and the public interest", "phrase": "being consistent with the public interest", "profession": "state officer", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"A State Officer should not make personal investments that could reasonably be expected to create a substantial conflict between the officer's or employee's private interest and the public interest\" \nConsider the rule provided above. In the following scenario, are the state officer's actions an example of being consistent with the public interest?\n\nScenario: A state officer shares unconventional ideas in a public forum."}, {"scenario_text": "An elected high-ranking state officer runs for a second term.", "question_text": "Using no more than 2 sentences, describe an example scenario for the state officer for which it is unclear whether it can be described as being consistent with the public interest", "intended_scenario_type": "Ambiguous", "avgRating": 3.75, "PhraseID": "Q18", "rule": "A State Officer should not make personal investments that could reasonably be expected to create a substantial conflict between the officer’s or employee’s private interest and the public interest", "phrase": "being consistent with the public interest", "profession": "state officer", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"A State Officer should not make personal investments that could reasonably be expected to create a substantial conflict between the officer's or employee's private interest and the public interest\" \nConsider the rule provided above. In the following scenario, are the state officer's actions an example of being consistent with the public interest?\n\nScenario: An elected high-ranking state officer runs for a second term."}, {"scenario_text": "The teacher shows a movie during class when they are tired.", "question_text": "Using no more than 2 sentences, describe an example scenario for the teacher for which it is unclear whether it can be described as promoting holistic development", "intended_scenario_type": "Ambiguous", "avgRating": 3.3333333333333335, "PhraseID": "Q66", "rule": "Teachers should acknowledge and respect the uniqueness, individuality and specific needs of pupils/students and promote their holistic development", "phrase": "promoting holistic development", "profession": "teacher", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Teachers should acknowledge and respect the uniqueness, individuality and specific needs of pupils/students and promote their holistic development\" \nConsider the rule provided above. In the following scenario, are the teacher's actions an example of promoting holistic development?\n\nScenario: The teacher shows a movie during class when they are tired."}, {"scenario_text": "The conservation scientist was uncertain about the impact of the research findings and decides to publish them anyway for personal gain.", "question_text": "Using no more than 2 sentences, describe an example scenario for the conservation scientist for which it is unclear whether it can be described as misrepresenting research", "intended_scenario_type": "Ambiguous", "avgRating": 3.6666666666666665, "PhraseID": "Q60", "rule": "Scrupulously avoid plagiarism; acknowledge the limitations of their research design, data, and interpretation of results; disclose conflicts of interest; honestly discuss their findings; and attempt to correct misrepresentation of their research by others.", "phrase": "misrepresenting research", "profession": "conservation scientist", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Scrupulously avoid plagiarism; acknowledge the limitations of their research design, data, and interpretation of results; disclose conflicts of interest; honestly discuss their findings; and attempt to correct misrepresentation of their research by others.\" \nConsider the rule provided above. In the following scenario, are the conservation scientist's actions an example of misrepresenting research?\n\nScenario: The conservation scientist was uncertain about the impact of the research findings and decides to publish them anyway for personal gain."}, {"scenario_text": "The fundraising professional abides by all company guidelines.", "question_text": "Using no more than 2 sentences, describe an example scenario for the fundraising professional for which it is unclear whether it can be described as acting according to the highest goals and visions", "intended_scenario_type": "Ambiguous", "avgRating": 3.25, "PhraseID": "Q40", "rule": "The Fundraising Professional will act according to the highest goals and visions of their organizations, professions, clients and consciences", "phrase": "acting according to the highest goals and visions", "profession": "fundraising professional ", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"The Fundraising Professional will act according to the highest goals and visions of their organizations, professions, clients and consciences\" \nConsider the rule provided above. In the following scenario, are the fundraising professional 's actions an example of acting according to the highest goals and visions?\n\nScenario: The fundraising professional abides by all company guidelines."}, {"scenario_text": "The fundraising professional throws a fundraising that does moderately okay.", "question_text": "Using no more than 2 sentences, describe an example scenario for the fundraising professional for which it is unclear whether it can be described as acting according to the highest goals and visions", "intended_scenario_type": "Ambiguous", "avgRating": 3.0, "PhraseID": "Q40", "rule": "The Fundraising Professional will act according to the highest goals and visions of their organizations, professions, clients and consciences", "phrase": "acting according to the highest goals and visions", "profession": "fundraising professional ", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"The Fundraising Professional will act according to the highest goals and visions of their organizations, professions, clients and consciences\" \nConsider the rule provided above. In the following scenario, are the fundraising professional 's actions an example of acting according to the highest goals and visions?\n\nScenario: The fundraising professional throws a fundraising that does moderately okay."}, {"scenario_text": "The Physicist published the findings without citing sources.", "question_text": "Using no more than 2 sentences, describe an example scenario for the physicist for which it is unclear whether it can be described as causing disrepute", "intended_scenario_type": "Ambiguous", "avgRating": 3.5, "PhraseID": "Q44", "rule": "The Physicist shall act with integrity and shall not intentionally bring the Institute of Physics, or the staff or other members of the Institute, into disrepute", "phrase": "causing disrepute", "profession": "physicist", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"The Physicist shall act with integrity and shall not intentionally bring the Institute of Physics, or the staff or other members of the Institute, into disrepute\" \nConsider the rule provided above. In the following scenario, are the physicist's actions an example of causing disrepute?\n\nScenario: The Physicist published the findings without citing sources."}, {"scenario_text": "A physicist publishes a paper with mixed reactions.", "question_text": "Using no more than 2 sentences, describe an example scenario for the physicist for which it is unclear whether it can be described as causing disrepute", "intended_scenario_type": "Ambiguous", "avgRating": 2.2, "PhraseID": "Q44", "rule": "The Physicist shall act with integrity and shall not intentionally bring the Institute of Physics, or the staff or other members of the Institute, into disrepute", "phrase": "causing disrepute", "profession": "physicist", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"The Physicist shall act with integrity and shall not intentionally bring the Institute of Physics, or the staff or other members of the Institute, into disrepute\" \nConsider the rule provided above. In the following scenario, are the physicist's actions an example of causing disrepute?\n\nScenario: A physicist publishes a paper with mixed reactions."}, {"scenario_text": "The wildlife professional holds a story time weekly for pre-schoolers that does not relate to wildlife.", "question_text": "Using no more than 2 sentences, describe an example scenario for the wildlife professional for which it is unclear whether it can be described as acting in the public interest", "intended_scenario_type": "Ambiguous", "avgRating": 3.5, "PhraseID": "Q73", "rule": "Recognize and inform clients or employers of the wildlife professional’s prime responsibility to the public interest, conservation of the wildlife resource, and the environment. They shall exercise professional judgment, and avoid actions or omissions that may compromise these broad responsibilities. They shall cooperate fully with other professionals in the best interest of the wildlife resource.", "phrase": "acting in the public interest", "profession": "wildlife professional", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Recognize and inform clients or employers of the wildlife professional's prime responsibility to the public interest, conservation of the wildlife resource, and the environment. They shall exercise professional judgment, and avoid actions or omissions that may compromise these broad responsibilities. They shall cooperate fully with other professionals in the best interest of the wildlife resource.\" \nConsider the rule provided above. In the following scenario, are the wildlife professional's actions an example of acting in the public interest?\n\nScenario: The wildlife professional holds a story time weekly for pre-schoolers that does not relate to wildlife."}, {"scenario_text": "The journalist takes photographs of local shelter dogs in her spare time, hoping to help lead to their adoptions.", "question_text": "Using no more than 2 sentences, describe an example scenario for the visual journalist for which it is unclear whether it can be described as giving special consideration to vulnerable subjects", "intended_scenario_type": "Ambiguous", "avgRating": 3.3333333333333335, "PhraseID": "Q52", "rule": "Treat all subjects with respect and dignity. Give special consideration to vulnerable subjects and compassion to victims of crime or tragedy. Intrude on private moments of grief only when the public has an overriding and justifiable need to see.", "phrase": "giving special consideration to vulnerable subjects", "profession": "visual journalist", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Treat all subjects with respect and dignity. Give special consideration to vulnerable subjects and compassion to victims of crime or tragedy. Intrude on private moments of grief only when the public has an overriding and justifiable need to see.\" \nConsider the rule provided above. In the following scenario, are the visual journalist's actions an example of giving special consideration to vulnerable subjects?\n\nScenario: The journalist takes photographs of local shelter dogs in her spare time, hoping to help lead to their adoptions."}, {"scenario_text": "The visual journalist's subject says they are only afraid of some spiders and are confronted by a large variety.", "question_text": "Using no more than 2 sentences, describe an example scenario for the visual journalist for which it is unclear whether it can be described as giving special consideration to vulnerable subjects", "intended_scenario_type": "Ambiguous", "avgRating": 2.25, "PhraseID": "Q52", "rule": "Treat all subjects with respect and dignity. Give special consideration to vulnerable subjects and compassion to victims of crime or tragedy. Intrude on private moments of grief only when the public has an overriding and justifiable need to see.", "phrase": "giving special consideration to vulnerable subjects", "profession": "visual journalist", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Treat all subjects with respect and dignity. Give special consideration to vulnerable subjects and compassion to victims of crime or tragedy. Intrude on private moments of grief only when the public has an overriding and justifiable need to see.\" \nConsider the rule provided above. In the following scenario, are the visual journalist's actions an example of giving special consideration to vulnerable subjects?\n\nScenario: The visual journalist's subject says they are only afraid of some spiders and are confronted by a large variety."}, {"scenario_text": "The architect was told that another member had stolen from them.", "question_text": "Using no more than 2 sentences, describe an example scenario for the architect for which it is unclear whether it can be described as having substantial information", "intended_scenario_type": "Ambiguous", "avgRating": 2.3333333333333335, "PhraseID": "Q7", "rule": "Members having substantial information which leads to a reasonable belief that another Member has committed a violation of this Code which raises a serious question as to that Member’s honesty, trustworthiness, or fitness as a Member, shall file a complaint with the National Ethics Council.", "phrase": "having substantial information", "profession": "architect", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Members having substantial information which leads to a reasonable belief that another Member has committed a violation of this Code which raises a serious question as to that Member's honesty, trustworthiness, or fitness as a Member, shall file a complaint with the National Ethics Council.\" \nConsider the rule provided above. In the following scenario, are the architect's actions an example of having substantial information?\n\nScenario: The architect was told that another member had stolen from them."}, {"scenario_text": "The architect is told by a member of their firm that a third member charged excessive and inflated project cost overrun fees to several clients, but the accuser and the alleged cheater are in the middle of a divorce.", "question_text": "Using no more than 2 sentences, describe an example scenario for the architect for which it is unclear whether it can be described as having substantial information", "intended_scenario_type": "Ambiguous", "avgRating": 3.0, "PhraseID": "Q7", "rule": "Members having substantial information which leads to a reasonable belief that another Member has committed a violation of this Code which raises a serious question as to that Member’s honesty, trustworthiness, or fitness as a Member, shall file a complaint with the National Ethics Council.", "phrase": "having substantial information", "profession": "architect", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Members having substantial information which leads to a reasonable belief that another Member has committed a violation of this Code which raises a serious question as to that Member's honesty, trustworthiness, or fitness as a Member, shall file a complaint with the National Ethics Council.\" \nConsider the rule provided above. In the following scenario, are the architect's actions an example of having substantial information?\n\nScenario: The architect is told by a member of their firm that a third member charged excessive and inflated project cost overrun fees to several clients, but the accuser and the alleged cheater are in the middle of a divorce."}, {"scenario_text": "The chemist accepts a very nice pen from a visiting salesman with the salesman's company's name on it.", "question_text": "Using no more than 2 sentences, describe an example scenario for the chemist for which it is unclear whether it can be described as accepting from more than one interested party", "intended_scenario_type": "Ambiguous", "avgRating": 2.6666666666666665, "PhraseID": "Q15", "rule": "To accept employment from more than one employer or client only when there is no conflict of interest; to accept commission or compensation in any form from more than one interested party only with the full knowledge and consent of all parties concerned;", "phrase": "accepting from more than one interested party", "profession": "chemist", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"To accept employment from more than one employer or client only when there is no conflict of interest; to accept commission or compensation in any form from more than one interested party only with the full knowledge and consent of all parties concerned;\" \nConsider the rule provided above. In the following scenario, are the chemist's actions an example of accepting from more than one interested party?\n\nScenario: The chemist accepts a very nice pen from a visiting salesman with the salesman's company's name on it."}, {"scenario_text": "The chemist talks to another chemist.", "question_text": "Using no more than 2 sentences, describe an example scenario for the chemist for which it is unclear whether it can be described as accepting from more than one interested party", "intended_scenario_type": "Ambiguous", "avgRating": 2.25, "PhraseID": "Q15", "rule": "To accept employment from more than one employer or client only when there is no conflict of interest; to accept commission or compensation in any form from more than one interested party only with the full knowledge and consent of all parties concerned;", "phrase": "accepting from more than one interested party", "profession": "chemist", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"To accept employment from more than one employer or client only when there is no conflict of interest; to accept commission or compensation in any form from more than one interested party only with the full knowledge and consent of all parties concerned;\" \nConsider the rule provided above. In the following scenario, are the chemist's actions an example of accepting from more than one interested party?\n\nScenario: The chemist talks to another chemist."}, {"scenario_text": "The chemist provides free educational materials to local schools about water quality while working on a project for the local government water authority.", "question_text": "Using no more than 2 sentences, describe an example scenario for the chemist for which it is unclear whether it can be described as accepting from more than one interested party", "intended_scenario_type": "Ambiguous", "avgRating": 2.5, "PhraseID": "Q15", "rule": "To accept employment from more than one employer or client only when there is no conflict of interest; to accept commission or compensation in any form from more than one interested party only with the full knowledge and consent of all parties concerned;", "phrase": "accepting from more than one interested party", "profession": "chemist", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"To accept employment from more than one employer or client only when there is no conflict of interest; to accept commission or compensation in any form from more than one interested party only with the full knowledge and consent of all parties concerned;\" \nConsider the rule provided above. In the following scenario, are the chemist's actions an example of accepting from more than one interested party?\n\nScenario: The chemist provides free educational materials to local schools about water quality while working on a project for the local government water authority."}, {"scenario_text": "The librarian hangs multiple signs around the library regarding upcoming events, with dates and times listed.", "question_text": "Using no more than 2 sentences, describe an example scenario for the librarian for which it is unclear whether it can be described as providing equitable access", "intended_scenario_type": "Ambiguous", "avgRating": 3.0, "PhraseID": "Q11", "rule": "We provide the highest level of service to all library users through appropriate and usefully organized resources; equitable service policies; equitable access; and accurate, unbiased, and courteous responses to all requests.", "phrase": "providing equitable access", "profession": "librarian", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"We provide the highest level of service to all library users through appropriate and usefully organized resources; equitable service policies; equitable access; and accurate, unbiased, and courteous responses to all requests.\" \nConsider the rule provided above. In the following scenario, are the librarian's actions an example of providing equitable access?\n\nScenario: The librarian hangs multiple signs around the library regarding upcoming events, with dates and times listed."}, {"scenario_text": "The librarian opens the doors at 7 am.", "question_text": "Using no more than 2 sentences, describe an example scenario for the librarian for which it is unclear whether it can be described as providing equitable access", "intended_scenario_type": "Ambiguous", "avgRating": 3.4, "PhraseID": "Q11", "rule": "We provide the highest level of service to all library users through appropriate and usefully organized resources; equitable service policies; equitable access; and accurate, unbiased, and courteous responses to all requests.", "phrase": "providing equitable access", "profession": "librarian", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"We provide the highest level of service to all library users through appropriate and usefully organized resources; equitable service policies; equitable access; and accurate, unbiased, and courteous responses to all requests.\" \nConsider the rule provided above. In the following scenario, are the librarian's actions an example of providing equitable access?\n\nScenario: The librarian opens the doors at 7 am."}, {"scenario_text": "The pastor gives general advice to all that come to him or her for help.", "question_text": "Using no more than 2 sentences, describe an example scenario for the pastor for which it is unclear whether it can be described as developing an awareness of personal needs", "intended_scenario_type": "Ambiguous", "avgRating": 3.5, "PhraseID": "Q49", "rule": "Identify a minister/counselor who can provide personal counseling and advice when needed. Develop an awareness of personal needs and vulnerabilities. Avoid taking advantage of the vulnerabilities of others through exploitation or manipulation. Address the misconduct of another clergy member directly or, if necessary, through appropriate persons to whom that member of the clergy may be accountable.", "phrase": "developing an awareness of personal needs", "profession": "pastor", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Identify a minister/counselor who can provide personal counseling and advice when needed. Develop an awareness of personal needs and vulnerabilities. Avoid taking advantage of the vulnerabilities of others through exploitation or manipulation. Address the misconduct of another clergy member directly or, if necessary, through appropriate persons to whom that member of the clergy may be accountable.\" \nConsider the rule provided above. In the following scenario, are the pastor's actions an example of developing an awareness of personal needs?\n\nScenario: The pastor gives general advice to all that come to him or her for help."}, {"scenario_text": "The pastor encourages young children to stay after hours to help them get educated about health hazards related to unprotected sex.", "question_text": "Using no more than 2 sentences, describe an example scenario for the pastor for which it is unclear whether it can be described as developing an awareness of personal needs", "intended_scenario_type": "Ambiguous", "avgRating": 2.3333333333333335, "PhraseID": "Q49", "rule": "Identify a minister/counselor who can provide personal counseling and advice when needed. Develop an awareness of personal needs and vulnerabilities. Avoid taking advantage of the vulnerabilities of others through exploitation or manipulation. Address the misconduct of another clergy member directly or, if necessary, through appropriate persons to whom that member of the clergy may be accountable.", "phrase": "developing an awareness of personal needs", "profession": "pastor", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Identify a minister/counselor who can provide personal counseling and advice when needed. Develop an awareness of personal needs and vulnerabilities. Avoid taking advantage of the vulnerabilities of others through exploitation or manipulation. Address the misconduct of another clergy member directly or, if necessary, through appropriate persons to whom that member of the clergy may be accountable.\" \nConsider the rule provided above. In the following scenario, are the pastor's actions an example of developing an awareness of personal needs?\n\nScenario: The pastor encourages young children to stay after hours to help them get educated about health hazards related to unprotected sex."}, {"scenario_text": "The professional donates their time to help the official's charity.", "question_text": "Using no more than 2 sentences, describe an example scenario for the designer for which it is unclear whether it can be described as offering a gift", "intended_scenario_type": "Ambiguous", "avgRating": 3.0, "PhraseID": "Q20", "rule": "A design professional shall neither offer nor make any payment or gift to a public official with the intent of influencing the official's judgment in connection with an existing or prospective project in which the designer is interested.", "phrase": "offering a gift", "profession": "designer", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"A design professional shall neither offer nor make any payment or gift to a public official with the intent of influencing the official's judgment in connection with an existing or prospective project in which the designer is interested.\" \nConsider the rule provided above. In the following scenario, are the designer's actions an example of offering a gift?\n\nScenario: The professional donates their time to help the official's charity."}, {"scenario_text": "The designer handed the governor an envelope", "question_text": "Using no more than 2 sentences, describe an example scenario for the designer for which it is unclear whether it can be described as offering a gift", "intended_scenario_type": "Ambiguous", "avgRating": 2.75, "PhraseID": "Q20", "rule": "A design professional shall neither offer nor make any payment or gift to a public official with the intent of influencing the official's judgment in connection with an existing or prospective project in which the designer is interested.", "phrase": "offering a gift", "profession": "designer", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"A design professional shall neither offer nor make any payment or gift to a public official with the intent of influencing the official's judgment in connection with an existing or prospective project in which the designer is interested.\" \nConsider the rule provided above. In the following scenario, are the designer's actions an example of offering a gift?\n\nScenario: The designer handed the governor an envelope"}, {"scenario_text": "The design professional's company agrees to be a sponsor for a kids' sports team that the public official's child is on.", "question_text": "Using no more than 2 sentences, describe an example scenario for the designer for which it is unclear whether it can be described as offering a gift", "intended_scenario_type": "Ambiguous", "avgRating": 3.6, "PhraseID": "Q20", "rule": "A design professional shall neither offer nor make any payment or gift to a public official with the intent of influencing the official's judgment in connection with an existing or prospective project in which the designer is interested.", "phrase": "offering a gift", "profession": "designer", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"A design professional shall neither offer nor make any payment or gift to a public official with the intent of influencing the official's judgment in connection with an existing or prospective project in which the designer is interested.\" \nConsider the rule provided above. In the following scenario, are the designer's actions an example of offering a gift?\n\nScenario: The design professional's company agrees to be a sponsor for a kids' sports team that the public official's child is on."}, {"scenario_text": "The teacher shares her phone number with the students, encouraging them to call for any reason. The teacher is called and texted by a student often who reveals personal information.", "question_text": "Using no more than 2 sentences, describe an example scenario for the teacher for which it is unclear whether it can be described as having a negative impact", "intended_scenario_type": "Ambiguous", "avgRating": 3.0, "PhraseID": "Q67", "rule": "Teachers should avoid conflict between their professional work and private interests which could reasonably be deemed to impact negatively on pupils/students.", "phrase": "having a negative impact", "profession": "teacher", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Teachers should avoid conflict between their professional work and private interests which could reasonably be deemed to impact negatively on pupils/students.\" \nConsider the rule provided above. In the following scenario, are the teacher's actions an example of having a negative impact?\n\nScenario: The teacher shares her phone number with the students, encouraging them to call for any reason. The teacher is called and texted by a student often who reveals personal information."}, {"scenario_text": "The teacher talked about various students with other teachers in the teacher lounge.", "question_text": "Using no more than 2 sentences, describe an example scenario for the teacher for which it is unclear whether it can be described as having a negative impact", "intended_scenario_type": "Ambiguous", "avgRating": 3.25, "PhraseID": "Q67", "rule": "Teachers should avoid conflict between their professional work and private interests which could reasonably be deemed to impact negatively on pupils/students.", "phrase": "having a negative impact", "profession": "teacher", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Teachers should avoid conflict between their professional work and private interests which could reasonably be deemed to impact negatively on pupils/students.\" \nConsider the rule provided above. In the following scenario, are the teacher's actions an example of having a negative impact?\n\nScenario: The teacher talked about various students with other teachers in the teacher lounge."}, {"scenario_text": "The teacher smokes weed by themselves at home on the weekends.", "question_text": "Using no more than 2 sentences, describe an example scenario for the teacher for which it is unclear whether it can be described as having a negative impact", "intended_scenario_type": "Ambiguous", "avgRating": 2.3333333333333335, "PhraseID": "Q67", "rule": "Teachers should avoid conflict between their professional work and private interests which could reasonably be deemed to impact negatively on pupils/students.", "phrase": "having a negative impact", "profession": "teacher", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Teachers should avoid conflict between their professional work and private interests which could reasonably be deemed to impact negatively on pupils/students.\" \nConsider the rule provided above. In the following scenario, are the teacher's actions an example of having a negative impact?\n\nScenario: The teacher smokes weed by themselves at home on the weekends."}, {"scenario_text": "The designer opened and read a lengthy email from the new client regarding their proposed project plans.", "question_text": "Using no more than 2 sentences, describe an example scenario for the designer for which it is unclear whether it can be described as assisting", "intended_scenario_type": "Ambiguous", "avgRating": 2.5, "PhraseID": "Q21", "rule": "A design professional shall not counsel or assist a client in conduct that the designer knows, or reasonably should know, is fraudulent or illegal.", "phrase": "assisting", "profession": "designer", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"A design professional shall not counsel or assist a client in conduct that the designer knows, or reasonably should know, is fraudulent or illegal.\" \nConsider the rule provided above. In the following scenario, are the designer's actions an example of assisting?\n\nScenario: The designer opened and read a lengthy email from the new client regarding their proposed project plans."}, {"scenario_text": "The journalist realizes that there could be potential danger if the subject continues with his behavior and decides that she needed to stop the situation even though it might ruin the story.", "question_text": "Using no more than 2 sentences, describe an example scenario for the visual journalist for which it is unclear whether it can be described as having an overriding and justifiable need", "intended_scenario_type": "Ambiguous", "avgRating": 2.6666666666666665, "PhraseID": "Q55", "rule": "Treat all subjects with respect and dignity. Give special consideration to vulnerable subjects and compassion to victims of crime or tragedy. Intrude on private moments of grief only when the public has an overriding and justifiable need to see.", "phrase": "having an overriding and justifiable need", "profession": "visual journalist", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Treat all subjects with respect and dignity. Give special consideration to vulnerable subjects and compassion to victims of crime or tragedy. Intrude on private moments of grief only when the public has an overriding and justifiable need to see.\" \nConsider the rule provided above. In the following scenario, are the visual journalist's actions an example of having an overriding and justifiable need?\n\nScenario: The journalist realizes that there could be potential danger if the subject continues with his behavior and decides that she needed to stop the situation even though it might ruin the story."}, {"scenario_text": "The physicist in medicine recommends a contract for a specific pacemaker model which is highly praised by 50% of patients, yet reviled by the other 50% of patients.", "question_text": "Using no more than 2 sentences, describe an example scenario for the physicist in medicine for which it is unclear whether it can be described as the best interests", "intended_scenario_type": "Ambiguous", "avgRating": 2.4285714285714284, "PhraseID": "Q25", "rule": "Members are frequently asked to participate in the selection of equipment and software for their institution or client. When members are engaged in this activity, the best interests of patients must come first.", "phrase": "prioritizing the best interests", "profession": "physicist in medicine", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Members are frequently asked to participate in the selection of equipment and software for their institution or client. When members are engaged in this activity, the best interests of patients must come first.\" \nConsider the rule provided above. In the following scenario, are the physicist in medicine's actions an example of the best interests?\n\nScenario: The physicist in medicine recommends a contract for a specific pacemaker model which is highly praised by 50% of patients, yet reviled by the other 50% of patients."}, {"scenario_text": "The physicist in medicine tested many types of software and came up with no particular best choice, and then chooses the one that was offered for a discounted price.", "question_text": "Using no more than 2 sentences, describe an example scenario for the physicist in medicine for which it is unclear whether it can be described as the best interests", "intended_scenario_type": "Ambiguous", "avgRating": 3.6666666666666665, "PhraseID": "Q25", "rule": "Members are frequently asked to participate in the selection of equipment and software for their institution or client. When members are engaged in this activity, the best interests of patients must come first.", "phrase": "prioritizing the best interests", "profession": "physicist in medicine", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Members are frequently asked to participate in the selection of equipment and software for their institution or client. When members are engaged in this activity, the best interests of patients must come first.\" \nConsider the rule provided above. In the following scenario, are the physicist in medicine's actions an example of the best interests?\n\nScenario: The physicist in medicine tested many types of software and came up with no particular best choice, and then chooses the one that was offered for a discounted price."}, {"scenario_text": "The professional briefly described to the interviewer why another professional’s results should be deemed unusable.", "question_text": "Using no more than 2 sentences, describe an example scenario for the chemical professional for which it is unclear whether it can be described as making public comments", "intended_scenario_type": "Ambiguous", "avgRating": 3.6666666666666665, "PhraseID": "Q26", "rule": "Public comments on scientific matters should be made with care and accuracy, without unsubstantiated, exaggerated, or premature statements.", "phrase": "making public comments", "profession": "chemical professional", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Public comments on scientific matters should be made with care and accuracy, without unsubstantiated, exaggerated, or premature statements.\" \nConsider the rule provided above. In the following scenario, are the chemical professional's actions an example of making public comments?\n\nScenario: The professional briefly described to the interviewer why another professional's results should be deemed unusable."}, {"scenario_text": "The chemical professional comments about his work at a talk for invited guests only.", "question_text": "Using no more than 2 sentences, describe an example scenario for the chemical professional for which it is unclear whether it can be described as making public comments", "intended_scenario_type": "Ambiguous", "avgRating": 3.6666666666666665, "PhraseID": "Q26", "rule": "Public comments on scientific matters should be made with care and accuracy, without unsubstantiated, exaggerated, or premature statements.", "phrase": "making public comments", "profession": "chemical professional", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Public comments on scientific matters should be made with care and accuracy, without unsubstantiated, exaggerated, or premature statements.\" \nConsider the rule provided above. In the following scenario, are the chemical professional's actions an example of making public comments?\n\nScenario: The chemical professional comments about his work at a talk for invited guests only."}, {"scenario_text": "The chemical professional comments about his work in an invite-only Facebook group.", "question_text": "Using no more than 2 sentences, describe an example scenario for the chemical professional for which it is unclear whether it can be described as making public comments", "intended_scenario_type": "Ambiguous", "avgRating": 3.2, "PhraseID": "Q26", "rule": "Public comments on scientific matters should be made with care and accuracy, without unsubstantiated, exaggerated, or premature statements.", "phrase": "making public comments", "profession": "chemical professional", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Public comments on scientific matters should be made with care and accuracy, without unsubstantiated, exaggerated, or premature statements.\" \nConsider the rule provided above. In the following scenario, are the chemical professional's actions an example of making public comments?\n\nScenario: The chemical professional comments about his work in an invite-only Facebook group."}, {"scenario_text": "The biologist collected DNA samples from a nearby homeless shelter.", "question_text": "Using no more than 2 sentences, describe an example scenario for the biologist for which it is unclear whether it can be described as striving for objectivity", "intended_scenario_type": "Ambiguous", "avgRating": 2.5, "PhraseID": "Q56", "rule": "Members should strive for objectivity in all professional and business judgments.", "phrase": "striving for objectivity", "profession": "biologist", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Members should strive for objectivity in all professional and business judgments.\" \nConsider the rule provided above. In the following scenario, are the biologist's actions an example of striving for objectivity?\n\nScenario: The biologist collected DNA samples from a nearby homeless shelter."}, {"scenario_text": "The biologist tests a product, without knowing she owns stock in the company that developed it.", "question_text": "Using no more than 2 sentences, describe an example scenario for the biologist for which it is unclear whether it can be described as striving for objectivity", "intended_scenario_type": "Ambiguous", "avgRating": 2.6666666666666665, "PhraseID": "Q56", "rule": "Members should strive for objectivity in all professional and business judgments.", "phrase": "striving for objectivity", "profession": "biologist", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Members should strive for objectivity in all professional and business judgments.\" \nConsider the rule provided above. In the following scenario, are the biologist's actions an example of striving for objectivity?\n\nScenario: The biologist tests a product, without knowing she owns stock in the company that developed it."}, {"scenario_text": "The chemist worked for months to synthesize a new chemical compound, but its function and properties were not known and were difficult to determine.", "question_text": "Using no more than 2 sentences, describe an example scenario for the chemist for which it is unclear whether it can be described as protecting the public interest", "intended_scenario_type": "Ambiguous", "avgRating": 3.0, "PhraseID": "Q16", "rule": "To perform all professional work in a manner that merits full confidence and trust; to be conservative in estimates, reports, and testimony, especially if these are related to the promotion of a business enterprise or the protection of the public interest, and to state explicitly any known bias embodies therein; to advise client or employer of the probability of success before undertaking a project;", "phrase": "protecting the public interest", "profession": "chemist", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"To perform all professional work in a manner that merits full confidence and trust; to be conservative in estimates, reports, and testimony, especially if these are related to the promotion of a business enterprise or the protection of the public interest, and to state explicitly any known bias embodies therein; to advise client or employer of the probability of success before undertaking a project;\" \nConsider the rule provided above. In the following scenario, are the chemist's actions an example of protecting the public interest?\n\nScenario: The chemist worked for months to synthesize a new chemical compound, but its function and properties were not known and were difficult to determine."}, {"scenario_text": "The chemist purchases lab supplies from a friend. That friend happens to be the best and most affordable vendor.", "question_text": "Using no more than 2 sentences, describe an example scenario for the chemist for which it is unclear whether it can be described as protecting the public interest", "intended_scenario_type": "Ambiguous", "avgRating": 3.6, "PhraseID": "Q16", "rule": "To perform all professional work in a manner that merits full confidence and trust; to be conservative in estimates, reports, and testimony, especially if these are related to the promotion of a business enterprise or the protection of the public interest, and to state explicitly any known bias embodies therein; to advise client or employer of the probability of success before undertaking a project;", "phrase": "protecting the public interest", "profession": "chemist", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"To perform all professional work in a manner that merits full confidence and trust; to be conservative in estimates, reports, and testimony, especially if these are related to the promotion of a business enterprise or the protection of the public interest, and to state explicitly any known bias embodies therein; to advise client or employer of the probability of success before undertaking a project;\" \nConsider the rule provided above. In the following scenario, are the chemist's actions an example of protecting the public interest?\n\nScenario: The chemist purchases lab supplies from a friend. That friend happens to be the best and most affordable vendor."}, {"scenario_text": "The realtor shows a house that had foundation issues.", "question_text": "Using no more than 2 sentences, describe an example scenario for the realtor for which it is unclear whether it can be described as presenting a true picture", "intended_scenario_type": "Ambiguous", "avgRating": 3.0, "PhraseID": "Q50", "rule": "Realtors shall be honest and truthful in their real estate communications and shall present a true picture in their advertising, marketing, and other representations. Realtors shall ensure that their status as real estate professionals is readily apparent in their advertising, marketing, and other representations, and that the recipients of all real estate communications are, or have been, notified that those communications are from a real estate professional.", "phrase": "presenting a true picture", "profession": "realtor", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Realtors shall be honest and truthful in their real estate communications and shall present a true picture in their advertising, marketing, and other representations. Realtors shall ensure that their status as real estate professionals is readily apparent in their advertising, marketing, and other representations, and that the recipients of all real estate communications are, or have been, notified that those communications are from a real estate professional.\" \nConsider the rule provided above. In the following scenario, are the realtor's actions an example of presenting a true picture?\n\nScenario: The realtor shows a house that had foundation issues."}, {"scenario_text": "The realtor states that the house can hold more than one child.", "question_text": "Using no more than 2 sentences, describe an example scenario for the realtor for which it is unclear whether it can be described as presenting a true picture", "intended_scenario_type": "Ambiguous", "avgRating": 3.5, "PhraseID": "Q50", "rule": "Realtors shall be honest and truthful in their real estate communications and shall present a true picture in their advertising, marketing, and other representations. Realtors shall ensure that their status as real estate professionals is readily apparent in their advertising, marketing, and other representations, and that the recipients of all real estate communications are, or have been, notified that those communications are from a real estate professional.", "phrase": "presenting a true picture", "profession": "realtor", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Realtors shall be honest and truthful in their real estate communications and shall present a true picture in their advertising, marketing, and other representations. Realtors shall ensure that their status as real estate professionals is readily apparent in their advertising, marketing, and other representations, and that the recipients of all real estate communications are, or have been, notified that those communications are from a real estate professional.\" \nConsider the rule provided above. In the following scenario, are the realtor's actions an example of presenting a true picture?\n\nScenario: The realtor states that the house can hold more than one child."}, {"scenario_text": "An economic developer decided to have a residential community rezoned to include commercial businesses, basing the decision on a survey given five years ago to residents.", "question_text": "Using no more than 2 sentences, describe an example scenario for the professional economic developer for which it is unclear whether it can be described as bringing respect", "intended_scenario_type": "Ambiguous", "avgRating": 3.3333333333333335, "PhraseID": "Q74", "rule": "Professional economic developers shall carry out their responsibilities in a manner to bring respect to the profession, the economic developer and the economic developer's constituencies.", "phrase": "bringing respect", "profession": "professional economic developer", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Professional economic developers shall carry out their responsibilities in a manner to bring respect to the profession, the economic developer and the economic developer's constituencies.\" \nConsider the rule provided above. In the following scenario, are the professional economic developer's actions an example of bringing respect?\n\nScenario: An economic developer decided to have a residential community rezoned to include commercial businesses, basing the decision on a survey given five years ago to residents."}, {"scenario_text": "The economic developer asked for a special meeting to discuss the city budget.", "question_text": "Using no more than 2 sentences, describe an example scenario for the professional economic developer for which it is unclear whether it can be described as bringing respect", "intended_scenario_type": "Ambiguous", "avgRating": 3.0, "PhraseID": "Q74", "rule": "Professional economic developers shall carry out their responsibilities in a manner to bring respect to the profession, the economic developer and the economic developer's constituencies.", "phrase": "bringing respect", "profession": "professional economic developer", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Professional economic developers shall carry out their responsibilities in a manner to bring respect to the profession, the economic developer and the economic developer's constituencies.\" \nConsider the rule provided above. In the following scenario, are the professional economic developer's actions an example of bringing respect?\n\nScenario: The economic developer asked for a special meeting to discuss the city budget."}, {"scenario_text": "The fundraising professional receives a high salary for their exceptional work.", "question_text": "Using no more than 2 sentences, describe an example scenario for the fundraising professional for which it is unclear whether it can be described as prioritizing philanthropic mission", "intended_scenario_type": "Ambiguous", "avgRating": 2.6666666666666665, "PhraseID": "Q37", "rule": "The Fundraising Professional will put philanthropic mission above personal gain", "phrase": "prioritizing philanthropic mission", "profession": "fundraising professional ", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"The Fundraising Professional will put philanthropic mission above personal gain\" \nConsider the rule provided above. In the following scenario, are the fundraising professional 's actions an example of prioritizing philanthropic mission?\n\nScenario: The fundraising professional receives a high salary for their exceptional work."}, {"scenario_text": "The fundraising professional donates money to a charity they are organizing.", "question_text": "Using no more than 2 sentences, describe an example scenario for the fundraising professional for which it is unclear whether it can be described as prioritizing philanthropic mission", "intended_scenario_type": "Ambiguous", "avgRating": 2.6666666666666665, "PhraseID": "Q37", "rule": "The Fundraising Professional will put philanthropic mission above personal gain", "phrase": "prioritizing philanthropic mission", "profession": "fundraising professional ", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"The Fundraising Professional will put philanthropic mission above personal gain\" \nConsider the rule provided above. In the following scenario, are the fundraising professional 's actions an example of prioritizing philanthropic mission?\n\nScenario: The fundraising professional donates money to a charity they are organizing."}, {"scenario_text": "The pastor hires a new piano player.", "question_text": "Using no more than 2 sentences, describe an example scenario for the pastor for which it is unclear whether it can be described as committing to the entire congregation's well-being", "intended_scenario_type": "Ambiguous", "avgRating": 3.6666666666666665, "PhraseID": "Q48", "rule": "Model the trustworthiness of God in leadership to encourage and develop trustworthiness in others. Use power and influence prudently and humbly. Foster loyalty. Demonstrate a commitment to the well-being of the entire congregation.", "phrase": "committing to the entire congregation's well-being", "profession": "pastor", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Model the trustworthiness of God in leadership to encourage and develop trustworthiness in others. Use power and influence prudently and humbly. Foster loyalty. Demonstrate a commitment to the well-being of the entire congregation.\" \nConsider the rule provided above. In the following scenario, are the pastor's actions an example of committing to the entire congregation's well-being?\n\nScenario: The pastor hires a new piano player."}, {"scenario_text": "The pastor schedules a sermon on the state of American politics, knowing that members of his congregation have strong political views.", "question_text": "Using no more than 2 sentences, describe an example scenario for the pastor for which it is unclear whether it can be described as committing to the entire congregation's well-being", "intended_scenario_type": "Ambiguous", "avgRating": 2.25, "PhraseID": "Q48", "rule": "Model the trustworthiness of God in leadership to encourage and develop trustworthiness in others. Use power and influence prudently and humbly. Foster loyalty. Demonstrate a commitment to the well-being of the entire congregation.", "phrase": "committing to the entire congregation's well-being", "profession": "pastor", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Model the trustworthiness of God in leadership to encourage and develop trustworthiness in others. Use power and influence prudently and humbly. Foster loyalty. Demonstrate a commitment to the well-being of the entire congregation.\" \nConsider the rule provided above. In the following scenario, are the pastor's actions an example of committing to the entire congregation's well-being?\n\nScenario: The pastor schedules a sermon on the state of American politics, knowing that members of his congregation have strong political views."}, {"scenario_text": "The veterinarian decides whether or not to euthanize an animal without considering the decision of the affected families and individuals.", "question_text": "Using no more than 2 sentences, describe an example scenario for the veterinarian for which it is unclear whether it can be described as having deficient character", "intended_scenario_type": "Ambiguous", "avgRating": 2.4, "PhraseID": "Q32", "rule": "A veterinarian shall uphold the standards of professionalism, be honest in all professional interactions, and report veterinarians who are deficient in character or competence to the appropriate entities.", "phrase": "having deficient character", "profession": "veterinarian", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"A veterinarian shall uphold the standards of professionalism, be honest in all professional interactions, and report veterinarians who are deficient in character or competence to the appropriate entities.\" \nConsider the rule provided above. In the following scenario, are the veterinarian's actions an example of having deficient character?\n\nScenario: The veterinarian decides whether or not to euthanize an animal without considering the decision of the affected families and individuals."}, {"scenario_text": "The chemical professional works extra hours at his workplace, and those extra hours are not compensated since his salary is fixed.", "question_text": "Using no more than 2 sentences, describe an example scenario for the chemical professional  for which it is unclear whether it can be described as providing fair compensation", "intended_scenario_type": "Ambiguous", "avgRating": 2.75, "PhraseID": "Q27", "rule": "Employers should provide them with a safe, congenial working environment, fair compensation, opportunities for advancement, and properly acknowledge their scientific contributions.", "phrase": "providing fair compensation", "profession": "chemical professional", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Employers should provide them with a safe, congenial working environment, fair compensation, opportunities for advancement, and properly acknowledge their scientific contributions.\" \nConsider the rule provided above. In the following scenario, are the chemical professional's actions an example of providing fair compensation?\n\nScenario: The chemical professional works extra hours at his workplace, and those extra hours are not compensated since his salary is fixed."}, {"scenario_text": "The newly graduated chemical professional earns the same salary as his coworker who has two years on-the-job experience.", "question_text": "Using no more than 2 sentences, describe an example scenario for the chemical professional  for which it is unclear whether it can be described as providing fair compensation", "intended_scenario_type": "Ambiguous", "avgRating": 3.0, "PhraseID": "Q27", "rule": "Employers should provide them with a safe, congenial working environment, fair compensation, opportunities for advancement, and properly acknowledge their scientific contributions.", "phrase": "providing fair compensation", "profession": "chemical professional", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Employers should provide them with a safe, congenial working environment, fair compensation, opportunities for advancement, and properly acknowledge their scientific contributions.\" \nConsider the rule provided above. In the following scenario, are the chemical professional's actions an example of providing fair compensation?\n\nScenario: The newly graduated chemical professional earns the same salary as his coworker who has two years on-the-job experience."}, {"scenario_text": "The architect makes safety videos available for his employees to watch but does not enforce that they actually adhere to them.", "question_text": "Using no more than 2 sentences, describe an example scenario for the architect for which it is unclear whether it can be described as making reasonable efforts", "intended_scenario_type": "Ambiguous", "avgRating": 2.6666666666666665, "PhraseID": "Q8", "rule": "Members shall make reasonable efforts to ensure that those over whom they have supervisory authority conform their conduct to this Code.", "phrase": "making reasonable efforts", "profession": "architect", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Members shall make reasonable efforts to ensure that those over whom they have supervisory authority conform their conduct to this Code.\" \nConsider the rule provided above. In the following scenario, are the architect's actions an example of making reasonable efforts?\n\nScenario: The architect makes safety videos available for his employees to watch but does not enforce that they actually adhere to them."}, {"scenario_text": "The architects utilizes other companies for outsourcing work, but doesn't necessarily check their code of conduct training.", "question_text": "Using no more than 2 sentences, describe an example scenario for the architect for which it is unclear whether it can be described as making reasonable efforts", "intended_scenario_type": "Ambiguous", "avgRating": 2.25, "PhraseID": "Q8", "rule": "Members shall make reasonable efforts to ensure that those over whom they have supervisory authority conform their conduct to this Code.", "phrase": "making reasonable efforts", "profession": "architect", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Members shall make reasonable efforts to ensure that those over whom they have supervisory authority conform their conduct to this Code.\" \nConsider the rule provided above. In the following scenario, are the architect's actions an example of making reasonable efforts?\n\nScenario: The architects utilizes other companies for outsourcing work, but doesn't necessarily check their code of conduct training."}, {"scenario_text": "The health physicist shares all possible consequences of the tests the patient will undergo, even those that are extremely rare and unlikely.", "question_text": "Using no more than 2 sentences, describe an example scenario for the health physicist for which it is unclear whether it can be described as making unwarranted statements", "intended_scenario_type": "Ambiguous", "avgRating": 3.6666666666666665, "PhraseID": "Q43", "rule": "Sensational and unwarranted statements of others concerning radiation and radiation protection shall be corrected by Health Physicists, when practical.", "phrase": "making unwarranted statements", "profession": "health physicist ", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Sensational and unwarranted statements of others concerning radiation and radiation protection shall be corrected by Health Physicists, when practical.\" \nConsider the rule provided above. In the following scenario, are the health physicist 's actions an example of making unwarranted statements?\n\nScenario: The health physicist shares all possible consequences of the tests the patient will undergo, even those that are extremely rare and unlikely."}, {"scenario_text": "The health physicist shares a story they read from a local newspaper regarding a resident who states that their cell phone gave them brain cancer.", "question_text": "Using no more than 2 sentences, describe an example scenario for the health physicist for which it is unclear whether it can be described as making unwarranted statements", "intended_scenario_type": "Ambiguous", "avgRating": 3.75, "PhraseID": "Q43", "rule": "Sensational and unwarranted statements of others concerning radiation and radiation protection shall be corrected by Health Physicists, when practical.", "phrase": "making unwarranted statements", "profession": "health physicist ", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Sensational and unwarranted statements of others concerning radiation and radiation protection shall be corrected by Health Physicists, when practical.\" \nConsider the rule provided above. In the following scenario, are the health physicist 's actions an example of making unwarranted statements?\n\nScenario: The health physicist shares a story they read from a local newspaper regarding a resident who states that their cell phone gave them brain cancer."}, {"scenario_text": "The biochemist/molecular biologist discusses the manuscripts with their colleagues.", "question_text": "Using no more than 2 sentences, describe an example scenario for the biochemist/molecular biologist for which it is unclear whether it can be described as avoiding inappropriate use", "intended_scenario_type": "Ambiguous", "avgRating": 2.2, "PhraseID": "Q31", "rule": "Biochemists/Molecular Biologists acting as reviewers will treat submitted manuscripts and grant applications confidentially and avoid inappropriate use", "phrase": "avoiding inappropriate use", "profession": "biochemist/molecular biologist", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Biochemists/Molecular Biologists acting as reviewers will treat submitted manuscripts and grant applications confidentially and avoid inappropriate use\" \nConsider the rule provided above. In the following scenario, are the biochemist/molecular biologist's actions an example of avoiding inappropriate use?\n\nScenario: The biochemist/molecular biologist discusses the manuscripts with their colleagues."}, {"scenario_text": "The massage therapist brushes her teeth every morning.", "question_text": "Using no more than 2 sentences, describe an example scenario for the massage therapist for which it is unclear whether it can be described as projecting a professional image", "intended_scenario_type": "Ambiguous", "avgRating": 3.75, "PhraseID": "Q28", "rule": "The Massage Therapist shall project a professional image and uphold the highest standards of professionalism.", "phrase": "projecting a professional image", "profession": "massage therapist ", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"The Massage Therapist shall project a professional image and uphold the highest standards of professionalism.\" \nConsider the rule provided above. In the following scenario, are the massage therapist 's actions an example of projecting a professional image?\n\nScenario: The massage therapist brushes her teeth every morning."}, {"scenario_text": "The biologist joins an organization that seeks to clone human organs for transplant purposes.", "question_text": "Using no more than 2 sentences, describe an example scenario for the biologist for which it is unclear whether it can be described as Behaving with questionable character", "intended_scenario_type": "Ambiguous", "avgRating": 3.0, "PhraseID": "Q63", "rule": "They will not associate or allow the use of their name on any enterprise known to be illegal, fraudulent or of questionable character.", "phrase": "Behaving with questionable character", "profession": "biologist", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"They will not associate or allow the use of their name on any enterprise known to be illegal, fraudulent or of questionable character.\" \nConsider the rule provided above. In the following scenario, are the biologist's actions an example of Behaving with questionable character?\n\nScenario: The biologist joins an organization that seeks to clone human organs for transplant purposes."}, {"scenario_text": "The biologist was featured in a recent news story.", "question_text": "Using no more than 2 sentences, describe an example scenario for the biologist for which it is unclear whether it can be described as Behaving with questionable character", "intended_scenario_type": "Ambiguous", "avgRating": 2.5, "PhraseID": "Q63", "rule": "They will not associate or allow the use of their name on any enterprise known to be illegal, fraudulent or of questionable character.", "phrase": "Behaving with questionable character", "profession": "biologist", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"They will not associate or allow the use of their name on any enterprise known to be illegal, fraudulent or of questionable character.\" \nConsider the rule provided above. In the following scenario, are the biologist's actions an example of Behaving with questionable character?\n\nScenario: The biologist was featured in a recent news story."}, {"scenario_text": "The biologist contributes significantly to the methodology of the published material or contributes research without being named in the article.", "question_text": "Using no more than 2 sentences, describe an example scenario for the biologist for which it is unclear whether it can be described as participating", "intended_scenario_type": "Ambiguous", "avgRating": 3.25, "PhraseID": "Q64", "rule": "They will accept authorship on published material only for work in which they have participated.", "phrase": "participating", "profession": "biologist", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"They will accept authorship on published material only for work in which they have participated.\" \nConsider the rule provided above. In the following scenario, are the biologist's actions an example of participating?\n\nScenario: The biologist contributes significantly to the methodology of the published material or contributes research without being named in the article."}, {"scenario_text": "A zoo intern deals with animals under very minimal supervision.", "question_text": "Using no more than 2 sentences, describe an example scenario for the zoo and aquarium professional for which it is unclear whether it can be described as maintaining the high standard of husbandry and welfare", "intended_scenario_type": "Ambiguous", "avgRating": 2.2, "PhraseID": "Q19", "rule": "Members will ensure institutions receiving animals have appropriate facilities to hold the animals and skilled staff who are capable of maintaining the same high standard of husbandry and welfare as required of WAZA members.", "phrase": "maintaining the high standard of husbandry and welfare", "profession": "zoo and aquarium professional", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Members will ensure institutions receiving animals have appropriate facilities to hold the animals and skilled staff who are capable of maintaining the same high standard of husbandry and welfare as required of WAZA members.\" \nConsider the rule provided above. In the following scenario, are the zoo and aquarium professional's actions an example of maintaining the high standard of husbandry and welfare?\n\nScenario: A zoo intern deals with animals under very minimal supervision."}, {"scenario_text": "An intern helps to design habitats for animals at the zoo and aquarium.", "question_text": "Using no more than 2 sentences, describe an example scenario for the zoo and aquarium professional for which it is unclear whether it can be described as maintaining the high standard of husbandry and welfare", "intended_scenario_type": "Ambiguous", "avgRating": 2.6666666666666665, "PhraseID": "Q19", "rule": "Members will ensure institutions receiving animals have appropriate facilities to hold the animals and skilled staff who are capable of maintaining the same high standard of husbandry and welfare as required of WAZA members.", "phrase": "maintaining the high standard of husbandry and welfare", "profession": "zoo and aquarium professional", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Members will ensure institutions receiving animals have appropriate facilities to hold the animals and skilled staff who are capable of maintaining the same high standard of husbandry and welfare as required of WAZA members.\" \nConsider the rule provided above. In the following scenario, are the zoo and aquarium professional's actions an example of maintaining the high standard of husbandry and welfare?\n\nScenario: An intern helps to design habitats for animals at the zoo and aquarium."}, {"scenario_text": "The zoo staff is always on time to feed the animals.", "question_text": "Using no more than 2 sentences, describe an example scenario for the zoo and aquarium professional for which it is unclear whether it can be described as maintaining the high standard of husbandry and welfare", "intended_scenario_type": "Ambiguous", "avgRating": 3.75, "PhraseID": "Q19", "rule": "Members will ensure institutions receiving animals have appropriate facilities to hold the animals and skilled staff who are capable of maintaining the same high standard of husbandry and welfare as required of WAZA members.", "phrase": "maintaining the high standard of husbandry and welfare", "profession": "zoo and aquarium professional", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Members will ensure institutions receiving animals have appropriate facilities to hold the animals and skilled staff who are capable of maintaining the same high standard of husbandry and welfare as required of WAZA members.\" \nConsider the rule provided above. In the following scenario, are the zoo and aquarium professional's actions an example of maintaining the high standard of husbandry and welfare?\n\nScenario: The zoo staff is always on time to feed the animals."}, {"scenario_text": "The staff cleans the animal areas in moderation.", "question_text": "Using no more than 2 sentences, describe an example scenario for the zoo and aquarium professional for which it is unclear whether it can be described as maintaining the high standard of husbandry and welfare", "intended_scenario_type": "Ambiguous", "avgRating": 3.4, "PhraseID": "Q19", "rule": "Members will ensure institutions receiving animals have appropriate facilities to hold the animals and skilled staff who are capable of maintaining the same high standard of husbandry and welfare as required of WAZA members.", "phrase": "maintaining the high standard of husbandry and welfare", "profession": "zoo and aquarium professional", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Members will ensure institutions receiving animals have appropriate facilities to hold the animals and skilled staff who are capable of maintaining the same high standard of husbandry and welfare as required of WAZA members.\" \nConsider the rule provided above. In the following scenario, are the zoo and aquarium professional's actions an example of maintaining the high standard of husbandry and welfare?\n\nScenario: The staff cleans the animal areas in moderation."}, {"scenario_text": "The biochemist gives visitors a tour of his lab.", "question_text": "Using no more than 2 sentences, describe an example scenario for the biochemist/molecular biologist for which it is unclear whether it can be described as reporting research findings", "intended_scenario_type": "Ambiguous", "avgRating": 3.3333333333333335, "PhraseID": "Q29", "rule": "The Biochemist/Molecular Biologist will report research findings resulting from public funding in a full, open, and timely fashion to the scientific community", "phrase": "reporting research findings", "profession": "biochemist/molecular biologist", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"The Biochemist/Molecular Biologist will report research findings resulting from public funding in a full, open, and timely fashion to the scientific community\" \nConsider the rule provided above. In the following scenario, are the biochemist/molecular biologist's actions an example of reporting research findings?\n\nScenario: The biochemist gives visitors a tour of his lab."}, {"scenario_text": "The biochemist goes through his colleague's notes on an old experiment, and reports findings that were not reported by his colleague.", "question_text": "Using no more than 2 sentences, describe an example scenario for the biochemist/molecular biologist for which it is unclear whether it can be described as reporting research findings", "intended_scenario_type": "Ambiguous", "avgRating": 3.6666666666666665, "PhraseID": "Q29", "rule": "The Biochemist/Molecular Biologist will report research findings resulting from public funding in a full, open, and timely fashion to the scientific community", "phrase": "reporting research findings", "profession": "biochemist/molecular biologist", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"The Biochemist/Molecular Biologist will report research findings resulting from public funding in a full, open, and timely fashion to the scientific community\" \nConsider the rule provided above. In the following scenario, are the biochemist/molecular biologist's actions an example of reporting research findings?\n\nScenario: The biochemist goes through his colleague's notes on an old experiment, and reports findings that were not reported by his colleague."}, {"scenario_text": "The veterinarian inputs records of their patients into a computer database.", "question_text": "Using no more than 2 sentences, describe an example scenario for the veterinarian for which it is unclear whether it can be described as bettering public health", "intended_scenario_type": "Ambiguous", "avgRating": 3.75, "PhraseID": "Q34", "rule": "A veterinarian shall recognize a responsibility to participate in activities contributing to the improvement of the community and the betterment of public health.", "phrase": "bettering public health", "profession": "veterinarian", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"A veterinarian shall recognize a responsibility to participate in activities contributing to the improvement of the community and the betterment of public health.\" \nConsider the rule provided above. In the following scenario, are the veterinarian's actions an example of bettering public health?\n\nScenario: The veterinarian inputs records of their patients into a computer database."}, {"scenario_text": "An architect takes on a simple job and he completes it without any fanfare.", "question_text": "Using no more than 2 sentences, describe an example scenario for the architect for which it is unclear whether it can be described as contributing to growth", "intended_scenario_type": "Ambiguous", "avgRating": 3.6666666666666665, "PhraseID": "Q2", "rule": "Members should maintain and advance their knowledge of the art and science of architecture, respect the body of architectural accomplishment, contribute to its growth, thoughtfully consider the social and environmental impact of their professional activities, and exercise learned and uncompromised professional judgment.", "phrase": "contributing to growth", "profession": "architect", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Members should maintain and advance their knowledge of the art and science of architecture, respect the body of architectural accomplishment, contribute to its growth, thoughtfully consider the social and environmental impact of their professional activities, and exercise learned and uncompromised professional judgment.\" \nConsider the rule provided above. In the following scenario, are the architect's actions an example of contributing to growth?\n\nScenario: An architect takes on a simple job and he completes it without any fanfare."}, {"scenario_text": "The biologist often leaves his secure notes from research out on his desk where others can see.", "question_text": "Using no more than 2 sentences, describe an example scenario for the biologist for which it is unclear whether it can be described as sharing a high degree of trust", "intended_scenario_type": "Ambiguous", "avgRating": 3.6, "PhraseID": "Q58", "rule": "The interpretation of these principles will vary from job to job, but all members have an obligation to: share with their employer a high degree of trust and confidence.", "phrase": "sharing a high degree of trust", "profession": "biologist", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"The interpretation of these principles will vary from job to job, but all members have an obligation to: share with their employer a high degree of trust and confidence.\" \nConsider the rule provided above. In the following scenario, are the biologist's actions an example of sharing a high degree of trust?\n\nScenario: The biologist often leaves his secure notes from research out on his desk where others can see."}, {"scenario_text": "The conservation scientist warns citizens about a deadly hurricane, which causes upheaval and distress although the hurricane never forms.", "question_text": "Using no more than 2 sentences, describe an example scenario for the conservation scientist for which it is unclear whether it can be described as protecting the welfare of human subjects", "intended_scenario_type": "Ambiguous", "avgRating": 3.6666666666666665, "PhraseID": "Q62", "rule": "Protect the rights and welfare of human subjects used in research and obtain the informed consent of those subjects.", "phrase": "protecting the welfare of human subjects", "profession": "conservation scientist", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Protect the rights and welfare of human subjects used in research and obtain the informed consent of those subjects.\" \nConsider the rule provided above. In the following scenario, are the conservation scientist's actions an example of protecting the welfare of human subjects?\n\nScenario: The conservation scientist warns citizens about a deadly hurricane, which causes upheaval and distress although the hurricane never forms."}, {"scenario_text": "The biologist takes samples and runs a series of tests that are directly related to her employer's project.", "question_text": "Using no more than 2 sentences, describe an example scenario for the biologist for which it is unclear whether it can be described as displaying professional misconduct", "intended_scenario_type": "Ambiguous", "avgRating": 2.4, "PhraseID": "Q57", "rule": "Members should take steps to prevent corrupt practices and professional misconduct.", "phrase": "displaying professional misconduct", "profession": "biologist", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Members should take steps to prevent corrupt practices and professional misconduct.\" \nConsider the rule provided above. In the following scenario, are the biologist's actions an example of displaying professional misconduct?\n\nScenario: The biologist takes samples and runs a series of tests that are directly related to her employer's project."}, {"scenario_text": "The biologist was unable to capture all of the data during the actual experiment.  He wasn't sure if he was going to be able to use the output from this trial.", "question_text": "Using no more than 2 sentences, describe an example scenario for the biologist for which it is unclear whether it can be described as displaying professional misconduct", "intended_scenario_type": "Ambiguous", "avgRating": 2.25, "PhraseID": "Q57", "rule": "Members should take steps to prevent corrupt practices and professional misconduct.", "phrase": "displaying professional misconduct", "profession": "biologist", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Members should take steps to prevent corrupt practices and professional misconduct.\" \nConsider the rule provided above. In the following scenario, are the biologist's actions an example of displaying professional misconduct?\n\nScenario: The biologist was unable to capture all of the data during the actual experiment.  He wasn't sure if he was going to be able to use the output from this trial."}, {"scenario_text": "The wildlife professional takes steps to ensure all the animals are safe.", "question_text": "Using no more than 2 sentences, describe an example scenario for the wildlife professional for which it is unclear whether it can be described as acting for personal satisfaction", "intended_scenario_type": "Ambiguous", "avgRating": 3.0, "PhraseID": "Q72", "rule": "Be mindful of their responsibility to society, and seek to meet the needs of all people when seeking advice in wildlife-related matters. They shall studiously avoid discrimination in any form, or the abuse of professional authority for personal satisfaction.", "phrase": "acting for personal satisfaction", "profession": "wildlife professional", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Be mindful of their responsibility to society, and seek to meet the needs of all people when seeking advice in wildlife-related matters. They shall studiously avoid discrimination in any form, or the abuse of professional authority for personal satisfaction.\" \nConsider the rule provided above. In the following scenario, are the wildlife professional's actions an example of acting for personal satisfaction?\n\nScenario: The wildlife professional takes steps to ensure all the animals are safe."}, {"scenario_text": "A wildlife professional writing a paper.", "question_text": "Using no more than 2 sentences, describe an example scenario for the wildlife professional for which it is unclear whether it can be described as acting for personal satisfaction", "intended_scenario_type": "Ambiguous", "avgRating": 3.0, "PhraseID": "Q72", "rule": "Be mindful of their responsibility to society, and seek to meet the needs of all people when seeking advice in wildlife-related matters. They shall studiously avoid discrimination in any form, or the abuse of professional authority for personal satisfaction.", "phrase": "acting for personal satisfaction", "profession": "wildlife professional", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Be mindful of their responsibility to society, and seek to meet the needs of all people when seeking advice in wildlife-related matters. They shall studiously avoid discrimination in any form, or the abuse of professional authority for personal satisfaction.\" \nConsider the rule provided above. In the following scenario, are the wildlife professional's actions an example of acting for personal satisfaction?\n\nScenario: A wildlife professional writing a paper."}, {"scenario_text": "The conservation scientist recommends conservation procedures on a park design for maximum conservation benefits hoping to receive recognition.", "question_text": "Using no more than 2 sentences, describe an example scenario for the conservation scientist for which it is unclear whether it can be described as allowing personal interests to interfere", "intended_scenario_type": "Ambiguous", "avgRating": 3.25, "PhraseID": "Q59", "rule": "Refuse to allow personal interests, compensation, or personal relationships to interfere with their professional judgment or advice.", "phrase": "allowing personal interests to interfere", "profession": "conservation scientist", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Refuse to allow personal interests, compensation, or personal relationships to interfere with their professional judgment or advice.\" \nConsider the rule provided above. In the following scenario, are the conservation scientist's actions an example of allowing personal interests to interfere?\n\nScenario: The conservation scientist recommends conservation procedures on a park design for maximum conservation benefits hoping to receive recognition."}, {"scenario_text": "The economic developer spoke at length about some parts of the project.", "question_text": "Using no more than 2 sentences, describe an example scenario for the professional economic developer for which it is unclear whether it can be described as practicing integrity", "intended_scenario_type": "Ambiguous", "avgRating": 3.25, "PhraseID": "Q75", "rule": "Professional economic developers shall practice with integrity, honesty, and adherence to the trust placed in them both in fact and in appearance.", "phrase": "practicing integrity", "profession": "professional economic developer", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Professional economic developers shall practice with integrity, honesty, and adherence to the trust placed in them both in fact and in appearance.\" \nConsider the rule provided above. In the following scenario, are the professional economic developer's actions an example of practicing integrity?\n\nScenario: The economic developer spoke at length about some parts of the project."}, {"scenario_text": "The economic developer uses the cheapest methods or materials.", "question_text": "Using no more than 2 sentences, describe an example scenario for the professional economic developer for which it is unclear whether it can be described as practicing integrity", "intended_scenario_type": "Ambiguous", "avgRating": 2.6666666666666665, "PhraseID": "Q75", "rule": "Professional economic developers shall practice with integrity, honesty, and adherence to the trust placed in them both in fact and in appearance.", "phrase": "practicing integrity", "profession": "professional economic developer", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Professional economic developers shall practice with integrity, honesty, and adherence to the trust placed in them both in fact and in appearance.\" \nConsider the rule provided above. In the following scenario, are the professional economic developer's actions an example of practicing integrity?\n\nScenario: The economic developer uses the cheapest methods or materials."}, {"scenario_text": "The physicist helps an intern complete his experiment for his senior class project.", "question_text": "Using no more than 2 sentences, describe an example scenario for the physicist for which it is unclear whether it can be described as presenting quality work", "intended_scenario_type": "Ambiguous", "avgRating": 3.6666666666666665, "PhraseID": "Q45", "rule": "The Physicist shall exercise all reasonable due diligence, in presenting quality work to the best of their ability, by critically assessing the likelihood of experimental, methodological, systematic or human errors and avoiding bias or unfair influence.", "phrase": "presenting quality work", "profession": "physicist", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"The Physicist shall exercise all reasonable due diligence, in presenting quality work to the best of their ability, by critically assessing the likelihood of experimental, methodological, systematic or human errors and avoiding bias or unfair influence.\" \nConsider the rule provided above. In the following scenario, are the physicist's actions an example of presenting quality work?\n\nScenario: The physicist helps an intern complete his experiment for his senior class project."}, {"scenario_text": "The Physicist contacted an ethics review committee.", "question_text": "Using no more than 2 sentences, describe an example scenario for the physicist for which it is unclear whether it can be described as presenting quality work", "intended_scenario_type": "Ambiguous", "avgRating": 3.0, "PhraseID": "Q45", "rule": "The Physicist shall exercise all reasonable due diligence, in presenting quality work to the best of their ability, by critically assessing the likelihood of experimental, methodological, systematic or human errors and avoiding bias or unfair influence.", "phrase": "presenting quality work", "profession": "physicist", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"The Physicist shall exercise all reasonable due diligence, in presenting quality work to the best of their ability, by critically assessing the likelihood of experimental, methodological, systematic or human errors and avoiding bias or unfair influence.\" \nConsider the rule provided above. In the following scenario, are the physicist's actions an example of presenting quality work?\n\nScenario: The Physicist contacted an ethics review committee."}, {"scenario_text": "The veterinarian runs into a client at a restaurant and chats with them.", "question_text": "Using no more than 2 sentences, describe an example scenario for the veterinarian for which it is unclear whether it can be described as being influenced by client needs", "intended_scenario_type": "Ambiguous", "avgRating": 3.2, "PhraseID": "Q35", "rule": "A veterinarian shall be influenced only by the welfare of the patient, the needs of the client, the safety of the public, and the need to uphold the public trust vested in the veterinary profession, and shall avoid conflicts of interest or the appearance thereof.", "phrase": "being influenced by client needs", "profession": "veterinarian", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"A veterinarian shall be influenced only by the welfare of the patient, the needs of the client, the safety of the public, and the need to uphold the public trust vested in the veterinary profession, and shall avoid conflicts of interest or the appearance thereof.\" \nConsider the rule provided above. In the following scenario, are the veterinarian's actions an example of being influenced by client needs?\n\nScenario: The veterinarian runs into a client at a restaurant and chats with them."}, {"scenario_text": "The veterinarian returns the clients call.", "question_text": "Using no more than 2 sentences, describe an example scenario for the veterinarian for which it is unclear whether it can be described as being influenced by client needs", "intended_scenario_type": "Ambiguous", "avgRating": 3.3333333333333335, "PhraseID": "Q35", "rule": "A veterinarian shall be influenced only by the welfare of the patient, the needs of the client, the safety of the public, and the need to uphold the public trust vested in the veterinary profession, and shall avoid conflicts of interest or the appearance thereof.", "phrase": "being influenced by client needs", "profession": "veterinarian", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"A veterinarian shall be influenced only by the welfare of the patient, the needs of the client, the safety of the public, and the need to uphold the public trust vested in the veterinary profession, and shall avoid conflicts of interest or the appearance thereof.\" \nConsider the rule provided above. In the following scenario, are the veterinarian's actions an example of being influenced by client needs?\n\nScenario: The veterinarian returns the clients call."}, {"scenario_text": "A veterinarian takes care of a stray animal that may or may not have an owner in relatively good condition.", "question_text": "Using no more than 2 sentences, describe an example scenario for the veterinarian for which it is unclear whether it can be described as being influenced by client needs", "intended_scenario_type": "Ambiguous", "avgRating": 2.8, "PhraseID": "Q35", "rule": "A veterinarian shall be influenced only by the welfare of the patient, the needs of the client, the safety of the public, and the need to uphold the public trust vested in the veterinary profession, and shall avoid conflicts of interest or the appearance thereof.", "phrase": "being influenced by client needs", "profession": "veterinarian", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"A veterinarian shall be influenced only by the welfare of the patient, the needs of the client, the safety of the public, and the need to uphold the public trust vested in the veterinary profession, and shall avoid conflicts of interest or the appearance thereof.\" \nConsider the rule provided above. In the following scenario, are the veterinarian's actions an example of being influenced by client needs?\n\nScenario: A veterinarian takes care of a stray animal that may or may not have an owner in relatively good condition."}, {"scenario_text": "The veterinarian feeds the stray cats on the streets.", "question_text": "Using no more than 2 sentences, describe an example scenario for the veterinarian for which it is unclear whether it can be described as being influenced by client needs", "intended_scenario_type": "Ambiguous", "avgRating": 2.8, "PhraseID": "Q35", "rule": "A veterinarian shall be influenced only by the welfare of the patient, the needs of the client, the safety of the public, and the need to uphold the public trust vested in the veterinary profession, and shall avoid conflicts of interest or the appearance thereof.", "phrase": "being influenced by client needs", "profession": "veterinarian", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"A veterinarian shall be influenced only by the welfare of the patient, the needs of the client, the safety of the public, and the need to uphold the public trust vested in the veterinary profession, and shall avoid conflicts of interest or the appearance thereof.\" \nConsider the rule provided above. In the following scenario, are the veterinarian's actions an example of being influenced by client needs?\n\nScenario: The veterinarian feeds the stray cats on the streets."}, {"scenario_text": "The biologist explains to a neighbor why they were not able to catch any fish in the nearby lake.", "question_text": "Using no more than 2 sentences, describe an example scenario for the biologist for which it is unclear whether it can be described as offering professional advice", "intended_scenario_type": "Ambiguous", "avgRating": 3.3333333333333335, "PhraseID": "Q65", "rule": "They will offer professional advice only on those subjects in which they are informed and qualified through professional training and experience.", "phrase": "offering professional advice", "profession": "biologist", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"They will offer professional advice only on those subjects in which they are informed and qualified through professional training and experience.\" \nConsider the rule provided above. In the following scenario, are the biologist's actions an example of offering professional advice?\n\nScenario: The biologist explains to a neighbor why they were not able to catch any fish in the nearby lake."}, {"scenario_text": "The biologist teaches a small class on the weekends.", "question_text": "Using no more than 2 sentences, describe an example scenario for the biologist for which it is unclear whether it can be described as offering professional advice", "intended_scenario_type": "Ambiguous", "avgRating": 3.75, "PhraseID": "Q65", "rule": "They will offer professional advice only on those subjects in which they are informed and qualified through professional training and experience.", "phrase": "offering professional advice", "profession": "biologist", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"They will offer professional advice only on those subjects in which they are informed and qualified through professional training and experience.\" \nConsider the rule provided above. In the following scenario, are the biologist's actions an example of offering professional advice?\n\nScenario: The biologist teaches a small class on the weekends."}, {"scenario_text": "The visual journalist talked to the soldiers before recording them during their training.", "question_text": "Using no more than 2 sentences, describe an example scenario for the visual journalist for which it is unclear whether it can be described as providing context", "intended_scenario_type": "Ambiguous", "avgRating": 3.6666666666666665, "PhraseID": "Q54", "rule": "Be complete and provide context when photographing or recording subjects. Avoid stereotyping individuals and groups. Recognize and work to avoid presenting one's own biases in the work.", "phrase": "providing context", "profession": "visual journalist", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Be complete and provide context when photographing or recording subjects. Avoid stereotyping individuals and groups. Recognize and work to avoid presenting one's own biases in the work.\" \nConsider the rule provided above. In the following scenario, are the visual journalist's actions an example of providing context?\n\nScenario: The visual journalist talked to the soldiers before recording them during their training."}, {"scenario_text": "The visual journalist records video of a town council meeting where name cards appear in front of council members, but the angle makes it unclear which names go with which people.", "question_text": "Using no more than 2 sentences, describe an example scenario for the visual journalist for which it is unclear whether it can be described as providing context", "intended_scenario_type": "Ambiguous", "avgRating": 2.6666666666666665, "PhraseID": "Q54", "rule": "Be complete and provide context when photographing or recording subjects. Avoid stereotyping individuals and groups. Recognize and work to avoid presenting one's own biases in the work.", "phrase": "providing context", "profession": "visual journalist", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Be complete and provide context when photographing or recording subjects. Avoid stereotyping individuals and groups. Recognize and work to avoid presenting one's own biases in the work.\" \nConsider the rule provided above. In the following scenario, are the visual journalist's actions an example of providing context?\n\nScenario: The visual journalist records video of a town council meeting where name cards appear in front of council members, but the angle makes it unclear which names go with which people."}, {"scenario_text": "The fundraising professional presents receipts for most transactions.", "question_text": "Using no more than 2 sentences, describe an example scenario for the fundraising professional for which it is unclear whether it can be described as safeguarding the public trust", "intended_scenario_type": "Ambiguous", "avgRating": 2.6666666666666665, "PhraseID": "Q36", "rule": "The Fundraising Professional will practice their profession with integrity, honesty, truthfulness and adherence to the absolute obligation to safeguard the public trust", "phrase": "safeguarding the public trust", "profession": "fundraising professional ", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"The Fundraising Professional will practice their profession with integrity, honesty, truthfulness and adherence to the absolute obligation to safeguard the public trust\" \nConsider the rule provided above. In the following scenario, are the fundraising professional 's actions an example of safeguarding the public trust?\n\nScenario: The fundraising professional presents receipts for most transactions."}, {"scenario_text": "The fundraising professional uses money from the charity.", "question_text": "Using no more than 2 sentences, describe an example scenario for the fundraising professional for which it is unclear whether it can be described as safeguarding the public trust", "intended_scenario_type": "Ambiguous", "avgRating": 2.3333333333333335, "PhraseID": "Q36", "rule": "The Fundraising Professional will practice their profession with integrity, honesty, truthfulness and adherence to the absolute obligation to safeguard the public trust", "phrase": "safeguarding the public trust", "profession": "fundraising professional ", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"The Fundraising Professional will practice their profession with integrity, honesty, truthfulness and adherence to the absolute obligation to safeguard the public trust\" \nConsider the rule provided above. In the following scenario, are the fundraising professional ‰Ûªs actions an example of safeguarding the public trust?\n\nScenario: The fundraising professional uses money from the charity."}, {"scenario_text": "The professional economic developer agreed to meet publicly with their client at a restaurant in the downtown business district.", "question_text": "Using no more than 2 sentences, describe an example scenario for the professional economic developer for which it is unclear whether it can be described as maintaining confidence in client affairs", "intended_scenario_type": "Ambiguous", "avgRating": 3.3333333333333335, "PhraseID": "Q76", "rule": "Professional economic developers shall maintain in confidence the affairs of any client, colleague or organization and shall not disclose confidential information obtained in the course of professional activities.", "phrase": "maintaining confidence in client affairs", "profession": "professional economic developer", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Professional economic developers shall maintain in confidence the affairs of any client, colleague or organization and shall not disclose confidential information obtained in the course of professional activities.\" \nConsider the rule provided above. In the following scenario, are the professional economic developer's actions an example of maintaining confidence in client affairs?\n\nScenario: The professional economic developer agreed to meet publicly with their client at a restaurant in the downtown business district."}, {"scenario_text": "The economic developer asks the client how their day at work has been.", "question_text": "Using no more than 2 sentences, describe an example scenario for the professional economic developer for which it is unclear whether it can be described as maintaining confidence in client affairs", "intended_scenario_type": "Ambiguous", "avgRating": 2.6666666666666665, "PhraseID": "Q76", "rule": "Professional economic developers shall maintain in confidence the affairs of any client, colleague or organization and shall not disclose confidential information obtained in the course of professional activities.", "phrase": "maintaining confidence in client affairs", "profession": "professional economic developer", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Professional economic developers shall maintain in confidence the affairs of any client, colleague or organization and shall not disclose confidential information obtained in the course of professional activities.\" \nConsider the rule provided above. In the following scenario, are the professional economic developer's actions an example of maintaining confidence in client affairs?\n\nScenario: The economic developer asks the client how their day at work has been."}, {"scenario_text": "The insurance agent tweaked the fine print of the policy.", "question_text": "Using no more than 2 sentences, describe an example scenario for the insurance professional for which it is unclear whether it can be described as engaging in bad faith misconduct", "intended_scenario_type": "Ambiguous", "avgRating": 3.0, "PhraseID": "Q47", "rule": "The Insurance Professional shall not have engaged in intentional, bad faith misconduct which is detrimental to IAIP at IAIP's sole determination", "phrase": "engaging in bad faith misconduct", "profession": "insurance professional ", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"The Insurance Professional shall not have engaged in intentional, bad faith misconduct which is detrimental to IAIP at IAIP's sole determination\" \nConsider the rule provided above. In the following scenario, are the insurance professional 's actions an example of engaging in bad faith misconduct?\n\nScenario: The insurance agent tweaked the fine print of the policy."}, {"scenario_text": "An insurance professional sells an insurance policy to an individual.", "question_text": "Using no more than 2 sentences, describe an example scenario for the insurance professional for which it is unclear whether it can be described as engaging in bad faith misconduct", "intended_scenario_type": "Ambiguous", "avgRating": 2.3333333333333335, "PhraseID": "Q47", "rule": "The Insurance Professional shall not have engaged in intentional, bad faith misconduct which is detrimental to IAIP at IAIP's sole determination", "phrase": "engaging in bad faith misconduct", "profession": "insurance professional ", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"The Insurance Professional shall not have engaged in intentional, bad faith misconduct which is detrimental to IAIP at IAIP's sole determination\" \nConsider the rule provided above. In the following scenario, are the insurance professional 's actions an example of engaging in bad faith misconduct?\n\nScenario: An insurance professional sells an insurance policy to an individual."}, {"scenario_text": "The physicist met with the other physicists to review the department publication.  She wanted to make sure that the academy would support their proposed research.", "question_text": "Using no more than 2 sentences, describe an example scenario for the physicist in medicine for which it is unclear whether it can be described as contributing substantially", "intended_scenario_type": "Ambiguous", "avgRating": 2.5, "PhraseID": "Q23", "rule": "Authorship of a scientific publication should be reserved for only those individuals who have contributed substantially to the conception and design of a research investigation and/or to the analysis and interpretation of data resulting from the investigation.", "phrase": "contributing substantially", "profession": "physicist in medicine", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Authorship of a scientific publication should be reserved for only those individuals who have contributed substantially to the conception and design of a research investigation and/or to the analysis and interpretation of data resulting from the investigation.\" \nConsider the rule provided above. In the following scenario, are the physicist in medicine's actions an example of contributing substantially?\n\nScenario: The physicist met with the other physicists to review the department publication.  She wanted to make sure that the academy would support their proposed research."}, {"scenario_text": "The chemist says he prefers his lab employees to arrive no later than 5 minutes on any given day.", "question_text": "Using no more than 2 sentences, describe an example scenario for the chemist for which it is unclear whether it can be described as having a clear agreement", "intended_scenario_type": "Ambiguous", "avgRating": 2.75, "PhraseID": "Q17", "rule": "To work for any client or employer under a clear agreement, preferable in writing, as to the ownership of data, plans, improvements, inventions, designs, or other intellectual property developed or discovered while so employed, understanding that in the absence of written agreement:", "phrase": "having a clear agreement", "profession": "chemist", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"To work for any client or employer under a clear agreement, preferable in writing, as to the ownership of data, plans, improvements, inventions, designs, or other intellectual property developed or discovered while so employed, understanding that in the absence of written agreement:\" \nConsider the rule provided above. In the following scenario, are the chemist's actions an example of having a clear agreement?\n\nScenario: The chemist says he prefers his lab employees to arrive no later than 5 minutes on any given day."}, {"scenario_text": "A teacher suspects that a student is having trouble at home due to dropping grades. The teacher asks the student about the problem and the student replies that he is overwhelmed by his sports team.", "question_text": "Using no more than 2 sentences, describe an example scenario for the teacher for which it is unclear whether it can be described as reporting on matters which impact student welfare", "intended_scenario_type": "Ambiguous", "avgRating": 3.0, "PhraseID": "Q69", "rule": "Teachers should report, where appropriate, incidents or matters which impact on pupil/student welfare", "phrase": "reporting on matters which impact student welfare", "profession": "teacher", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Teachers should report, where appropriate, incidents or matters which impact on pupil/student welfare\" \nConsider the rule provided above. In the following scenario, are the teacher's actions an example of reporting on matters which impact student welfare?\n\nScenario: A teacher suspects that a student is having trouble at home due to dropping grades. The teacher asks the student about the problem and the student replies that he is overwhelmed by his sports team."}, {"scenario_text": "The teacher schedules a class late in the day, so the students can get more sleep.", "question_text": "Using no more than 2 sentences, describe an example scenario for the teacher for which it is unclear whether it can be described as reporting on matters which impact student welfare", "intended_scenario_type": "Ambiguous", "avgRating": 2.25, "PhraseID": "Q69", "rule": "Teachers should report, where appropriate, incidents or matters which impact on pupil/student welfare", "phrase": "reporting on matters which impact student welfare", "profession": "teacher", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Teachers should report, where appropriate, incidents or matters which impact on pupil/student welfare\" \nConsider the rule provided above. In the following scenario, are the teacher's actions an example of reporting on matters which impact student welfare?\n\nScenario: The teacher schedules a class late in the day, so the students can get more sleep."}, {"scenario_text": "A teacher tries to get more information about a student's home life.", "question_text": "Using no more than 2 sentences, describe an example scenario for the teacher for which it is unclear whether it can be described as reporting on matters which impact student welfare", "intended_scenario_type": "Ambiguous", "avgRating": 2.6666666666666665, "PhraseID": "Q69", "rule": "Teachers should report, where appropriate, incidents or matters which impact on pupil/student welfare", "phrase": "reporting on matters which impact student welfare", "profession": "teacher", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Teachers should report, where appropriate, incidents or matters which impact on pupil/student welfare\" \nConsider the rule provided above. In the following scenario, are the teacher's actions an example of reporting on matters which impact student welfare?\n\nScenario: A teacher tries to get more information about a student's home life."}, {"scenario_text": "The architect is unsure whether to ask the client for specific sizes for their new windows", "question_text": "Using no more than 2 sentences, describe an example scenario for the architect for which it is unclear whether it can be described as acting with client's consent", "intended_scenario_type": "Ambiguous", "avgRating": 2.3333333333333335, "PhraseID": "Q5", "rule": "Members shall not materially alter the scope or objectives of a project without the client’s consent.", "phrase": "acting with client's consent", "profession": "architect", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Members shall not materially alter the scope or objectives of a project without the client's consent.\" \nConsider the rule provided above. In the following scenario, are the architect's actions an example of acting with client's consent?\n\nScenario: The architect is unsure whether to ask the client for specific sizes for their new windows"}, {"scenario_text": "The physicist in medicine wrote the following as part of their peer review: \"Whether this work advances our knowledge of tumor genomics with new graphene quantum dot image labeling methodologies is unclear as the authors have yet to provide evidence that their techniques are repeatable.\"", "question_text": "Using no more than 2 sentences, describe an example scenario for the physicist in medicine for which it is unclear whether it can be described as making derogatory critiques", "intended_scenario_type": "Ambiguous", "avgRating": 2.5, "PhraseID": "Q24", "rule": "The editor is responsible for ensuring that the peer review process of the journal is objective and fair, and that reviews do not contain derogatory critiques or disparaging remarks.", "phrase": "making derogatory critiques", "profession": "physicist in medicine", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"The editor is responsible for ensuring that the peer review process of the journal is objective and fair, and that reviews do not contain derogatory critiques or disparaging remarks.\" \nConsider the rule provided above. In the following scenario, are the physicist in medicine's actions an example of making derogatory critiques?\n\nScenario: The physicist in medicine wrote the following as part of their peer review: \"Whether this work advances our knowledge of tumor genomics with new graphene quantum dot image labeling methodologies is unclear as the authors have yet to provide evidence that their techniques are repeatable.\""}, {"scenario_text": "The physicist in medicine describes the peer reviewed paper as being written at a high school level.", "question_text": "Using no more than 2 sentences, describe an example scenario for the physicist in medicine for which it is unclear whether it can be described as making derogatory critiques", "intended_scenario_type": "Ambiguous", "avgRating": 3.25, "PhraseID": "Q24", "rule": "The editor is responsible for ensuring that the peer review process of the journal is objective and fair, and that reviews do not contain derogatory critiques or disparaging remarks.", "phrase": "making derogatory critiques", "profession": "physicist in medicine", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"The editor is responsible for ensuring that the peer review process of the journal is objective and fair, and that reviews do not contain derogatory critiques or disparaging remarks.\" \nConsider the rule provided above. In the following scenario, are the physicist in medicine's actions an example of making derogatory critiques?\n\nScenario: The physicist in medicine describes the peer reviewed paper as being written at a high school level."}, {"scenario_text": "An organization holds a design competition to solicit design ideas and one is chosen as the winner. The design then gets used as part of a bigger publication.", "question_text": "Using no more than 2 sentences, describe an example scenario for the architect for which it is unclear whether it can be described as respecting professional contributions", "intended_scenario_type": "Ambiguous", "avgRating": 3.6666666666666665, "PhraseID": "Q9", "rule": "Members shall recognize and respect the professional contributions of their employees, employers, professional colleagues, and business associates.", "phrase": "respecting professional contributions", "profession": "architect", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Members shall recognize and respect the professional contributions of their employees, employers, professional colleagues, and business associates.\" \nConsider the rule provided above. In the following scenario, are the architect's actions an example of respecting professional contributions?\n\nScenario: An organization holds a design competition to solicit design ideas and one is chosen as the winner. The design then gets used as part of a bigger publication."}, {"scenario_text": "An architect seems to use one particular quirk for each of his buildings that makes his recognizable among others. It's always easy to notice, but people can't seem to recognize the source.", "question_text": "Using no more than 2 sentences, describe an example scenario for the architect for which it is unclear whether it can be described as respecting professional contributions", "intended_scenario_type": "Ambiguous", "avgRating": 2.5, "PhraseID": "Q9", "rule": "Members shall recognize and respect the professional contributions of their employees, employers, professional colleagues, and business associates.", "phrase": "respecting professional contributions", "profession": "architect", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Members shall recognize and respect the professional contributions of their employees, employers, professional colleagues, and business associates.\" \nConsider the rule provided above. In the following scenario, are the architect's actions an example of respecting professional contributions?\n\nScenario: An architect seems to use one particular quirk for each of his buildings that makes his recognizable among others. It's always easy to notice, but people can't seem to recognize the source."}, {"scenario_text": "An architect tries to get good results in his project but instead gets distracted with another task.", "question_text": "Using no more than 2 sentences, describe an example scenario for the architect for which it is unclear whether it can be described as respecting professional contributions", "intended_scenario_type": "Ambiguous", "avgRating": 2.3333333333333335, "PhraseID": "Q9", "rule": "Members shall recognize and respect the professional contributions of their employees, employers, professional colleagues, and business associates.", "phrase": "respecting professional contributions", "profession": "architect", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Members shall recognize and respect the professional contributions of their employees, employers, professional colleagues, and business associates.\" \nConsider the rule provided above. In the following scenario, are the architect's actions an example of respecting professional contributions?\n\nScenario: An architect tries to get good results in his project but instead gets distracted with another task."}, {"scenario_text": "The architect completes all assignments during work hours.", "question_text": "Using no more than 2 sentences, describe an example scenario for the architect for which it is unclear whether it can be described as respecting professional contributions", "intended_scenario_type": "Ambiguous", "avgRating": 3.25, "PhraseID": "Q9", "rule": "Members shall recognize and respect the professional contributions of their employees, employers, professional colleagues, and business associates.", "phrase": "respecting professional contributions", "profession": "architect", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Members shall recognize and respect the professional contributions of their employees, employers, professional colleagues, and business associates.\" \nConsider the rule provided above. In the following scenario, are the architect's actions an example of respecting professional contributions?\n\nScenario: The architect completes all assignments during work hours."}, {"scenario_text": "The health physicist receives allegations against a researcher in the lab about an abusive workplace environment and decides to discuss the allegations anonymously with the researcher over dinner.", "question_text": "Using no more than 2 sentences, describe an example scenario for the health physicist for which it is unclear whether it can be described as reflecting the highest standard of integrity", "intended_scenario_type": "Ambiguous", "avgRating": 3.0, "PhraseID": "Q41", "rule": "The Health Physicist shall ensure all relations with members, employers, coworkers, clients, governmental agencies, and the general public shall be based upon and shall reflect the highest standard of integrity and fairness.", "phrase": "reflecting the highest standard of integrity", "profession": "health physicist ", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"The Health Physicist shall ensure all relations with members, employers, coworkers, clients, governmental agencies, and the general public shall be based upon and shall reflect the highest standard of integrity and fairness.\" \nConsider the rule provided above. In the following scenario, are the health physicist 's actions an example of reflecting the highest standard of integrity?\n\nScenario: The health physicist receives allegations against a researcher in the lab about an abusive workplace environment and decides to discuss the allegations anonymously with the researcher over dinner."}, {"scenario_text": "The teacher spends class time in such a way that students tend to like her.", "question_text": "Using no more than 2 sentences, describe an example scenario for the teacher for which it is unclear whether it can be described as upholding reputation", "intended_scenario_type": "Ambiguous", "avgRating": 3.0, "PhraseID": "Q68", "rule": "Teachers should uphold the reputation and standing of the profession", "phrase": "upholding reputation", "profession": "teacher", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Teachers should uphold the reputation and standing of the profession\" \nConsider the rule provided above. In the following scenario, are the teacher's actions an example of upholding reputation?\n\nScenario: The teacher spends class time in such a way that students tend to like her."}, {"scenario_text": "The teacher cares about their job, but never spends extra time to prepare for class.", "question_text": "Using no more than 2 sentences, describe an example scenario for the teacher for which it is unclear whether it can be described as upholding reputation", "intended_scenario_type": "Ambiguous", "avgRating": 3.0, "PhraseID": "Q68", "rule": "Teachers should uphold the reputation and standing of the profession", "phrase": "upholding reputation", "profession": "teacher", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Teachers should uphold the reputation and standing of the profession\" \nConsider the rule provided above. In the following scenario, are the teacher's actions an example of upholding reputation?\n\nScenario: The teacher cares about their job, but never spends extra time to prepare for class."}, {"scenario_text": "The teacher carries out their duties, but does not strive to distinguish themselves in any way.", "question_text": "Using no more than 2 sentences, describe an example scenario for the teacher for which it is unclear whether it can be described as upholding reputation", "intended_scenario_type": "Ambiguous", "avgRating": 2.8333333333333335, "PhraseID": "Q68", "rule": "Teachers should uphold the reputation and standing of the profession", "phrase": "upholding reputation", "profession": "teacher", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Teachers should uphold the reputation and standing of the profession\" \nConsider the rule provided above. In the following scenario, are the teacher's actions an example of upholding reputation?\n\nScenario: The teacher carries out their duties, but does not strive to distinguish themselves in any way."}, {"scenario_text": "The teacher informs her students that she will be retiring at the end of the school year.", "question_text": "Using no more than 2 sentences, describe an example scenario for the teacher for which it is unclear whether it can be described as upholding reputation", "intended_scenario_type": "Ambiguous", "avgRating": 3.75, "PhraseID": "Q68", "rule": "Teachers should uphold the reputation and standing of the profession", "phrase": "upholding reputation", "profession": "teacher", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Teachers should uphold the reputation and standing of the profession\" \nConsider the rule provided above. In the following scenario, are the teacher's actions an example of upholding reputation?\n\nScenario: The teacher informs her students that she will be retiring at the end of the school year."}, {"scenario_text": "The architect compliments the drawing of a competing architect.", "question_text": "Using no more than 2 sentences, describe an example scenario for the architect for which it is unclear whether it can be described as relying on advice", "intended_scenario_type": "Ambiguous", "avgRating": 3.2, "PhraseID": "Q4", "rule": "In performing professional services, members shall take into account applicable laws and regulations. Members may rely on the advice of other qualified persons as to the intent and meaning of such regulations.", "phrase": "relying on advice", "profession": "architect", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"In performing professional services, members shall take into account applicable laws and regulations. Members may rely on the advice of other qualified persons as to the intent and meaning of such regulations.\" \nConsider the rule provided above. In the following scenario, are the architect's actions an example of relying on advice?\n\nScenario: The architect compliments the drawing of a competing architect."}, {"scenario_text": "The visual journalist used photo editing software while preparing her latest story.", "question_text": "Using no more than 2 sentences, describe an example scenario for the visual journalist for which it is unclear whether it can be described as manipulating images", "intended_scenario_type": "Ambiguous", "avgRating": 3.0, "PhraseID": "Q53", "rule": "Editing should maintain the integrity of the photographic images' content and context. Do not manipulate images or add or alter sound in any way that can mislead viewers or misrepresent subjects.", "phrase": "manipulating images", "profession": "visual journalist", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Editing should maintain the integrity of the photographic images' content and context. Do not manipulate images or add or alter sound in any way that can mislead viewers or misrepresent subjects.\" \nConsider the rule provided above. In the following scenario, are the visual journalist's actions an example of manipulating images?\n\nScenario: The visual journalist used photo editing software while preparing her latest story."}, {"scenario_text": "The visual journalist adjusted the lighting in the photograph.", "question_text": "Using no more than 2 sentences, describe an example scenario for the visual journalist for which it is unclear whether it can be described as manipulating images", "intended_scenario_type": "Ambiguous", "avgRating": 3.2, "PhraseID": "Q53", "rule": "Editing should maintain the integrity of the photographic images' content and context. Do not manipulate images or add or alter sound in any way that can mislead viewers or misrepresent subjects.", "phrase": "manipulating images", "profession": "visual journalist", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Editing should maintain the integrity of the photographic images' content and context. Do not manipulate images or add or alter sound in any way that can mislead viewers or misrepresent subjects.\" \nConsider the rule provided above. In the following scenario, are the visual journalist's actions an example of manipulating images?\n\nScenario: The visual journalist adjusted the lighting in the photograph."}, {"scenario_text": "The librarian hangs posters about popular vacation destinations in the library.", "question_text": "Using no more than 2 sentences, describe an example scenario for the librarian for which it is unclear whether it can be described as upholding intellectual freedom", "intended_scenario_type": "Ambiguous", "avgRating": 2.3333333333333335, "PhraseID": "Q12", "rule": "We uphold the principles of intellectual freedom and resist all efforts to censor library resources.", "phrase": "upholding intellectual freedom", "profession": "librarian", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"We uphold the principles of intellectual freedom and resist all efforts to censor library resources.\" \nConsider the rule provided above. In the following scenario, are the librarian's actions an example of upholding intellectual freedom?\n\nScenario: The librarian hangs posters about popular vacation destinations in the library."}, {"scenario_text": "The librarian gossips with several other librarians about workplace problems.", "question_text": "Using no more than 2 sentences, describe an example scenario for the librarian for which it is unclear whether it can be described as upholding intellectual freedom", "intended_scenario_type": "Ambiguous", "avgRating": 2.6666666666666665, "PhraseID": "Q12", "rule": "We uphold the principles of intellectual freedom and resist all efforts to censor library resources.", "phrase": "upholding intellectual freedom", "profession": "librarian", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"We uphold the principles of intellectual freedom and resist all efforts to censor library resources.\" \nConsider the rule provided above. In the following scenario, are the librarian's actions an example of upholding intellectual freedom?\n\nScenario: The librarian gossips with several other librarians about workplace problems."}, {"scenario_text": "The librarian has a limited rare books budget, and chooses to purchase a rare copy of the Bible instead of a rare copy of Mein Kampf.", "question_text": "Using no more than 2 sentences, describe an example scenario for the librarian for which it is unclear whether it can be described as upholding intellectual freedom", "intended_scenario_type": "Ambiguous", "avgRating": 2.6666666666666665, "PhraseID": "Q12", "rule": "We uphold the principles of intellectual freedom and resist all efforts to censor library resources.", "phrase": "upholding intellectual freedom", "profession": "librarian", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"We uphold the principles of intellectual freedom and resist all efforts to censor library resources.\" \nConsider the rule provided above. In the following scenario, are the librarian's actions an example of upholding intellectual freedom?\n\nScenario: The librarian has a limited rare books budget, and chooses to purchase a rare copy of the Bible instead of a rare copy of Mein Kampf."}, {"scenario_text": "The wildlife professional rounds decimals in their calculations when favorable.", "question_text": "Using no more than 2 sentences, describe an example scenario for the wildlife professional for which it is unclear whether it can be described as suppressing results", "intended_scenario_type": "Ambiguous", "avgRating": 3.0, "PhraseID": "Q70", "rule": "Refrain from fabrication, falsification, or suppression of results, and shall not deliberately misrepresent research findings, or otherwise commit scientific fraud.", "phrase": "suppressing results", "profession": "wildlife professional", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Refrain from fabrication, falsification, or suppression of results, and shall not deliberately misrepresent research findings, or otherwise commit scientific fraud.\" \nConsider the rule provided above. In the following scenario, are the wildlife professional's actions an example of suppressing results?\n\nScenario: The wildlife professional rounds decimals in their calculations when favorable."}, {"scenario_text": "A wildlife professional does not know whether to show all the results or show only what he thinks supports his hypothesis.", "question_text": "Using no more than 2 sentences, describe an example scenario for the wildlife professional for which it is unclear whether it can be described as suppressing results", "intended_scenario_type": "Ambiguous", "avgRating": 2.75, "PhraseID": "Q70", "rule": "Refrain from fabrication, falsification, or suppression of results, and shall not deliberately misrepresent research findings, or otherwise commit scientific fraud.", "phrase": "suppressing results", "profession": "wildlife professional", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Refrain from fabrication, falsification, or suppression of results, and shall not deliberately misrepresent research findings, or otherwise commit scientific fraud.\" \nConsider the rule provided above. In the following scenario, are the wildlife professional's actions an example of suppressing results?\n\nScenario: A wildlife professional does not know whether to show all the results or show only what he thinks supports his hypothesis."}, {"scenario_text": "The architect's firm tell their firm colleagues to recycle, but fail to provide recycling bins in all of their offices.", "question_text": "Using no more than 2 sentences, describe an example scenario for the architect for which it is unclear whether it can be described as using sustainable practices", "intended_scenario_type": "Ambiguous", "avgRating": 2.6666666666666665, "PhraseID": "Q10", "rule": "Members should use sustainable practices within their firms and professional organizations, and they should encourage their clients to do the same.", "phrase": "using sustainable practices", "profession": "architect", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Members should use sustainable practices within their firms and professional organizations, and they should encourage their clients to do the same.\" \nConsider the rule provided above. In the following scenario, are the architect's actions an example of using sustainable practices?\n\nScenario: The architect's firm tell their firm colleagues to recycle, but fail to provide recycling bins in all of their offices."}, {"scenario_text": "The architect designs buildings that contain low-flow water systems that must be replaced every three years.", "question_text": "Using no more than 2 sentences, describe an example scenario for the architect for which it is unclear whether it can be described as using sustainable practices", "intended_scenario_type": "Ambiguous", "avgRating": 3.6666666666666665, "PhraseID": "Q10", "rule": "Members should use sustainable practices within their firms and professional organizations, and they should encourage their clients to do the same.", "phrase": "using sustainable practices", "profession": "architect", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Members should use sustainable practices within their firms and professional organizations, and they should encourage their clients to do the same.\" \nConsider the rule provided above. In the following scenario, are the architect's actions an example of using sustainable practices?\n\nScenario: The architect designs buildings that contain low-flow water systems that must be replaced every three years."}, {"scenario_text": "Over drinks, the architect told his reporter friend that his companies newest project thad been cancelled.", "question_text": "Using no more than 2 sentences, describe an example scenario for the architect for which it is unclear whether it can be described as making public statements", "intended_scenario_type": "Ambiguous", "avgRating": 3.3333333333333335, "PhraseID": "Q3", "rule": "Members making public statements on architectural issues shall disclose when they are being compensated for making such statements or when they have an economic interest in the issue.", "phrase": "making public statements", "profession": "architect", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Members making public statements on architectural issues shall disclose when they are being compensated for making such statements or when they have an economic interest in the issue.\" \nConsider the rule provided above. In the following scenario, are the architect's actions an example of making public statements?\n\nScenario: Over drinks, the architect told his reporter friend that his companies newest project thad been cancelled."}, {"scenario_text": "The wildlife professional shares his lunch with a monkey.", "question_text": "Using no more than 2 sentences, describe an example scenario for the wildlife professional for which it is unclear whether it can be described as acting in the best interest", "intended_scenario_type": "Ambiguous", "avgRating": 3.0, "PhraseID": "Q71", "rule": "Provide maximum possible effort in the best interest of each client or employer, regardless of the degree of remuneration.", "phrase": "acting in the best interest", "profession": "wildlife professional", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"Provide maximum possible effort in the best interest of each client or employer, regardless of the degree of remuneration.\" \nConsider the rule provided above. In the following scenario, are the wildlife professional's actions an example of acting in the best interest?\n\nScenario: The wildlife professional shares his lunch with a monkey."}, {"scenario_text": "The biochemist briefly cites his research in a journal article.", "question_text": "Using no more than 2 sentences, describe an example scenario for the biochemist/molecular biologist for which it is unclear whether it can be described as adequately summarizing", "intended_scenario_type": "Ambiguous", "avgRating": 2.6666666666666665, "PhraseID": "Q30", "rule": "The Biochemist/Molecular Biologist in their publications will adequately summarize previous relevant work", "phrase": "adequately summarizing", "profession": "biochemist/molecular biologist", "question_text_2": "The following is a rule/text from a code of ethics:\nRule: \"The Biochemist/Molecular Biologist in their publications will adequately summarize previous relevant work\" \nConsider the rule provided above. In the following scenario, are the biochemist/molecular biologist's actions an example of adequately summarizing?\n\nScenario: The biochemist briefly cites his research in a journal article."}]